Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: Configuration
ru_ru: Настройка

source: Localization
ru_ru: Локализация

source: Locales
ru_ru: Языковые настройки

source: Network
ru_ru: Сеть

source: Name resolution
ru_ru: Разрешение имён

source: Users
ru_ru: Пользователи

source: Groups
ru_ru: Группы

source: Accounts
ru_ru: Учётные записи

source: Command-line interpreter
ru_ru: Командный интерпретатор

source: Shell
ru_ru: Оболочка

source: Printing
ru_ru: Печать

source: Bootloader
ru_ru: Загрузчик

source: Kernel compiling
ru_ru: Компиляция ядра

source: Basic Configuration: Network, Accounts, Printing...
ru_ru: Основные настройки: сеть, учётные записи, печать...

source: A computer with a new installation created with <command>debian-installer</command> is intended to be as functional as possible, but many services still have to be configured. Furthermore, it is always good to know how to change certain configuration elements defined during the initial installation process.
ru_ru: Подразумевается, что компьютер со вновь установленной с помощью <command>debian-installer</command> системой будет настолько функционален, насколько это возможно, но многие службы всё ещё необходимо будет настроить. Более того, всегда полезно знать о том как изменить определённые элементы конфигурации, созданные во время первоначальной настройки.

source: This chapter reviews everything included in what we could call the “basic configuration”: networking, language and locales, users and groups, printing, mount points, etc.
ru_ru: В этой главе представлен обзор тех элементов, что входят в так называемую “базовую настройку”: сеть, язык и языковые настройки, пользователи и группы, печать, точки монтирования и т. д.

source: Configuring the System for Another Language
ru_ru: Изменение системного языка

source: <primary>French localization</primary>
ru_ru: <primary>Французская локализация</primary>

source: If the system was installed using French, the machine will probably already have French set as the default language. But it is good to know what the installer does to set the language, so that later, if the need arises, you can change it.
ru_ru: Если система была установлена с использованием французского языка, то, скорее всего, этот язык уже будет установлен на компьютере в качестве языка по умолчанию. Но вам стоит знать, как установщик настраивает текущий язык для того, чтоб вы могли изменить его при необходимости.

source: <emphasis>TOOL</emphasis> The <command>locale</command> command to display the current configuration
ru_ru: <emphasis>ИНСТРУМЕНТ</emphasis> Команда <command>locale</command> для вывода текущей настройки

source: The <command>locale</command> command lists a summary of the current configuration of various locale parameters (date format, numbers format, etc.), presented in the form of a group of standard environment variables dedicated to the dynamic modification of these settings.
ru_ru: Команда <command>locale</command> выводит краткий список основных языковых настроек (формат даты, числовые форматы и т. д.), представленных в виде переменных окружения среды и предназначенных для оперативного изменения соответствующих настроек.

source: Setting the Default Language
ru_ru: Установка языка по умолчанию

source: <primary>locales</primary>
ru_ru: <primary>языковые настройки</primary>

source: <primary>language</primary>
ru_ru: <primary>язык</primary>

source: <emphasis>CULTURE</emphasis> Character sets
ru_ru: <emphasis>КУЛЬТУРА</emphasis> Наборы символов

source: <primary>character set</primary>
ru_ru: <primary>набор символов</primary>

source: <primary>encoding</primary>
ru_ru: <primary>коодировка</primary>

source: Historically, each locale has an associated “character set” (group of known characters) and a preferred “encoding” (internal representation for characters within the computer).
ru_ru: Исторически сложилось, что каждая языковая настройка имеет связанный с ней “набор символов” (группа известных символов) и предпочитаемую “кодировку” (внутреннее представление символов в компьютере).

source: <primary>Unicode</primary>
ru_ru: <primary>Юникод</primary>

source: <primary>environment</primary>
ru_ru: <primary>окружение</primary>

source: <primary>locale</primary>
ru_ru: <primary>языковая настройка</primary>

source: <emphasis>BEHIND THE SCENES</emphasis> <filename>/etc/environment</filename> and <filename>/etc/default/locale</filename>
ru_ru: <emphasis>ЗА КУЛИСАМИ</emphasis> <filename>/etc/environment</filename> и <filename>/etc/default/locale</filename>

source: The <filename>/etc/environment</filename> file provides the <command>login</command>, <command>gdm</command>, or even <command>ssh</command> programs with the correct environment variables to be created.
ru_ru: Файл <filename>/etc/environment</filename> обеспечивает программы <command>login</command>, <command>gdm</command> или даже <command>ssh</command> информацией, необходимой для корректного создания переменных окружения.

source: These applications do not create these variables directly, but rather via a PAM (<filename>pam_env.so</filename>) module. PAM (Pluggable Authentication Module) is a modular library centralizing the mechanisms for authentication, session initialization, and password management. See <xref linkend="sect.config-pam" /> for an example of PAM configuration.
ru_ru: Данные приложения не создают эти переменные напрямую, а используют модуль PAM (<filename>pam_env.so</filename>). PAM (подключаемый модуль аутентификации) - это модульная библиотека, в которой сосредоточены механизмы аутентификации, инициализации сессии и управления паролями. См. <xref linkend="sect.config-pam" /> в качестве примера настройки PAM.

source: Configuring the Keyboard
ru_ru: Настройка клавиатуры

source: <primary>keyboard layout</primary>
ru_ru: <primary>раскладка клавиатуры</primary>

source: Note that the keyboard configuration for graphical mode described here only affects the default layout; the GNOME and KDE environments, among others, provide a keyboard control panel in their preferences allowing each user to have their own configuration. Some additional options regarding the behavior of some particular keys are also available in these control panels.
ru_ru: Отметим, что описанная здесь настройка клавиатуры для графического режима относится только к раскладке по умолчанию; графические окружения GNOME и KDE, как и некоторые другие, имеют в своём составе панель управления клавиатурой, с помощью которой каждый пользователь может выполнить собственную настройку. Также на этих панелях доступны дополнительные настройки для некоторых специальных клавиш.

source: Migrating to UTF-8
ru_ru: Переход на UTF-8

source: The generalization of UTF-8 encoding has been a long awaited solution to numerous difficulties with interoperability, since it facilitates international exchange and removes the arbitrary limits on characters that can be used in a document. The one drawback is that it had to go through a rather difficult transition phase. Since it could not be completely transparent (that is, it could not happen at the same time all over the world), two conversion operations were required: one on file contents, and the other on filenames. Fortunately, the bulk of this migration has been completed and we discuss it largely for reference.
ru_ru: Обобщение, принятое в кодировке UTF-8, стало долгожданным решением многочисленных проблем совместимости, поскольку оно способствует международному обмену и устраняет жёсткие ограничения на используемые в документах символы. Одним из препятствий на пути внедрения этой кодировки была сложная переходная фаза. Поскольку эта фаза не могла быть полностью прозрачной (т. е. она не могла произойти одновременно во всём мире), то преобразование необходимо было выполнять в два этапа: сначала для содержимого файлов, затем для имён файлов. К счастью, большая часть этого перехода уже выполнена, и мы рассматриваем его здесь в качестве исторической справки.

source: <emphasis>CULTURE</emphasis> <foreignphrase>Mojibake</foreignphrase> and interpretation errors
ru_ru: <emphasis>КУЛЬТУРА</emphasis> <foreignphrase>Mojibake</foreignphrase> и ошибки перевода

source: When a text is sent (or stored) without encoding information, it is not always possible for the recipient to know with certainty what convention to use for determining the meaning of a set of bytes. You can usually get an idea by getting statistics on the distribution of values present in the text, but that doesn't always give a definite answer. When the encoding system chosen for reading differs from that used in writing the file, the bytes are mis-interpreted, and you get, at best, errors on some characters, or, at worst, something completely illegible.
ru_ru: Если текст передаётся (или хранится) без информации о кодировании, то получатель не всегда может определить то соглашение, что используется для представления некоторого набора байтов. Обычно вы можете получить некоторое представление, собрав статистику распределения значений в тексте, но подобный подход не гарантирует точного результата. В том случае когда система кодирования для чтения файла выбрана отличной от той, что использовалась для его создания, значения байтов интерпретируются неверно, и вы в результате получите ошибочные символы или, в худшем случае, полностью неразборчивый текст.

source: Thus, if a French text appears normal with the exception of accented letters and certain symbols which appear to be replaced with sequences of characters like “Ã©” or Ã¨” or “Ã§”, it is probably a file encoded as UTF-8 but interpreted as ISO-8859-1 or ISO-8859-15. This is a sign of a local installation that has not yet been migrated to UTF-8. If, instead, you see question marks instead of accented letters — even if these question marks seem to also replace a character that should have followed the accented letter — it is likely that your installation is already configured for UTF-8 and that you have been sent a document encoded in Western ISO.
ru_ru: Таким образом, если текст на французском выглядит нормально за исключением ударных букв и некоторых символов, которые были заменены последовательностями символов вида “Ã©”, ”Ã¨” или “Ã§”, то, вероятно, файл имеет кодировку UTF-8, но интерпретируется как ISO-8859-1 или ISO-8859-15. Подобное поведение является признаком локальной инсталляции, которая ещё не была переведена на UTF-8. Если же вы видите знаки вопроса вместо ударных букв, даже если эти знаки вопроса замещают соседние с ударными буквы, то скорее всего ваша система уже настроена с поддержкой UTF-8, но вам отправили документ в кодировке Western ISO.

source: So much for “simple” cases. These cases only appear in Western culture, since Unicode (and UTF-8) was designed to maximize the common points with historical encodings for Western languages based on the Latin alphabet, which allows recognition of parts of the text even when some characters are missing.
ru_ru: Это всё, что касается “простых” случаев. Подобные ситуации характерны для западных языков, поскольку кодировка Юникод (и UTF-8) была спроектирована похожей на традиционные кодировки западных языков, основанных на латинском алфавите, что позволяет распознать часть текста даже в том случае, когда некоторые символы в нём отсутствуют.

source: In more complex configurations, which, for example, involve two environments corresponding to two different languages that do not use the same alphabet, you often get completely illegible results — a series of abstract symbols that have nothing to do with each other. This is especially common with Asian languages due to their numerous languages and writing systems. The Japanese word <foreignphrase>mojibake</foreignphrase> has been adopted to describe this phenomenon. When it appears, diagnosis is more complex and the simplest solution is often to simply migrate to UTF-8 on both sides.
ru_ru: В более сложных случаях, включающих в себя, например, два окружения с двумя различными языками, в которых используются различные алфавиты, вы можете получить полностью нечитаемый текст - набор абстрактных символов, которые никак не связаны между собой. Подобное часто случается с азиатскими языками вследствие многообразия как самих языков, так и систем письма. Для описания такого явления было принято использовать японское слово <foreignphrase>mojibake</foreignphrase>. Если вы столкнулись с подобным, то диагностика становится ещё более сложной и зачастую самым простым решением для обеих сторон будет переход на UTF-8.

source: As far as file names are concerned, the migration can be relatively simple. The <command>convmv</command> tool (in the package with the same name) was created specifically for this purpose; it allows renaming files from one encoding to another. The use of this tool is relatively simple, but we recommend doing it in two steps to avoid surprises. The following example illustrates a UTF-8 environment containing directory names encoded in ISO-8859-15, and the use of <command>convmv</command> to rename them.
ru_ru: Что касается имён файлов, то здесь переход может быть относительно простым. Утилита <command>convmv</command> (из одноимённого пакета) поможет вам с этим; она умеет изменять имена файлов из одной кодировки в другую. Пользоваться этим инструментом довольно просто, но мы рекомендуем делать это в два этапа во избежание сюрпризов. Следующий пример демонстрирует окружение с кодировкой UTF-8, каталоги в котором имеют кодировку ISO-8859-15, и применение <command>convmv</command> для их переименования.

source: For simple text files, you can use <command>recode</command> (in the package of the same name) which allows automatic recoding. This tool has numerous options so you can play with its behavior. We recommend you consult the documentation, the <citerefentry> <refentrytitle>recode</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> man page, or the <citerefentry> <refentrytitle>recode</refentrytitle> </citerefentry> info page (more complete).
ru_ru: Для простых текстовых файлов можно использовать <command>recode</command> (из одноимённого пакета), которая перекодирует автоматически. Это программа обладает множеством опций, поэтому вы можете попробовать несколько вариантов её поведения. Мы рекомендуем вам ознакомиться с документацией, страницей руководства <citerefentry> <refentrytitle>recode</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> или с информационной страницей <citerefentry> <refentrytitle>recode</refentrytitle> </citerefentry> (которая содержит более подробную информацию).

source: Configuring the Network
ru_ru: Настройка сети

source: <emphasis>BACK TO BASICS</emphasis> Essential network concepts (Ethernet, IP address, subnet, broadcast).
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Основные понятия (Ethernet, IP адрес, подсеть, широковещательный запрос)

source: <primary>RJ45 connector</primary>
ru_ru: <primary>разъём RJ45</primary>

source: Most modern local networks use the Ethernet protocol, where data is split into small blocks called frames and transmitted on the wire one frame at a time. Data speeds vary from 10 Mb/s for older Ethernet cards to 10 Gb/s in the newest cards (with the most common rate currently growing from 100 Mb/s to 1 Gb/s). The most widely used cables are called 10BASE-T, 100BASE-T, 1000BASE-T or 10GBASE-T depending on the throughput they can reliably provide (the T stands for “twisted pair”); those cables end in an RJ45 connector. There are other cable types, used mostly for speeds above 1 Gb/s.
ru_ru: Современные локальные сети построены на основе протокола Ethernet, в котором данные разбиваются на маленькие блоки, называемые кадрами, и последовательно передаются по проводам. Скорость передачи варьируется от 10 Мбит/с в случае устаревших Ethernet карт до 10 Гбит/с для современых (наиболее распространённые значения в настоящее время увеличиваются от 100 Мбит/с до 1 Гбит/с). Наиболее распространённые типы кабелей имеют маркировку 10BASE-T, 100BASE-T, 1000BASE-T или 10GBASE-T в зависимости от той пропускной способности, которую они могут надёжно обеспечить (T означает “витая пара”); такие кабели оканчиваются разъёмом RG45. Существуют и другие типы кабелей, которые используются в основном при скоростях выше 1 Гбит/с.

source: <primary>IP address</primary>
ru_ru: <primary>IP адрес</primary>

source: <primary>subnet</primary>
ru_ru: <primary>подсеть</primary>

source: <primary>mask</primary><secondary>subnet mask</secondary>
ru_ru: <primary>маска</primary><secondary>маска подсети</secondary>

source: <primary>network</primary><secondary>address</secondary>
ru_ru: <primary>сетевой</primary><secondary>адрес</secondary>

source: A subnet mask (netmask) defines in its binary code which portion of an IP address corresponds to the network, the remainder specifying the machine. In the example of configuring a static IPv4 address given here, the subnet mask, <literal>255.255.255.0</literal> (24 “1”s followed by 8 “0”s in binary representation) indicates that the first 24 bits of the IP address correspond to the network address, and the other 8 are specific to the machine. In IPv6, for readability, only the number of “1”s is expressed; the netmask for an IPv6 network could, thus, be <literal>64</literal>.
ru_ru: Двоичный код маски подсети (сетевой маски) определяет ту часть IP адреса, которая соответствует адресу сети, а оставшаяся часть составляет адрес машины. В приведённом здесь примере настройки статического IPv4 адреса маска подсети, <literal>255.255.255.0</literal> (24 “1”, за которыми следуют 8 “0” в двоичном представлении), указывает на то, что первые 24 бита IP адреса соответствуют адресу сети, а остальные 8 - адресу машины. В IPv6 для надёжности указывается только количество единиц; таким образом, маска подсети в IPv6 сети может быть представлена как <literal>64</literal>.

source: <primary>router</primary>
ru_ru: <primary>маршрутизатор</primary>

source: <primary>bridge</primary>
ru_ru: <primary>мост</primary>

source: A router is a machine that connects several networks to each other. All traffic coming through a router is guided to the correct network. To do this, the router analyzes incoming packets and redirects them according to the IP address of their destination. The router is often known as a gateway; in this configuration, it works as a machine that helps reach out beyond a local network (towards an extended network, such as the Internet).
ru_ru: Маршрутизатор - это устройство, соединяющее между собой несколько сетей. Весь трафик, проходящий через маршрутизатор, направляется в заданную сеть. Для этого маршрутизатор анализирует входящие пакеты и перенаправляет их в соответствии с IP адресом приёмника. Маршрутизатор часто называют шлюзом; выполняя функцию шлюза, он помогает выйти за пределы локальной сети (в более обширные сети, такие как Интернет).

source: <primary>broadcast</primary>
ru_ru: <primary>широковещательный</primary>

source: The special broadcast address connects all the stations in a network. Almost never “routed”, it only functions on the network in question. Specifically, it means that a data packet addressed to the broadcast never passes through the router.
ru_ru: Специальный широковещательный адрес объединяет все узлы сети. Он существует только в заданной сети и практически никогда не маршрутизируется. Точнее, он означает, что широковещательный пакет данных никогда не проходит через маршрутизатор.

source: This chapter focuses on IPv4 addresses, since they are currently the most commonly used. The details of the IPv6 protocol are approached in <xref linkend="sect.ipv6" />, but the concepts remain the same.
ru_ru: В этой главе мы сосредоточимся на IPv4 адресах, поскольку они являются наиболее распространёнными в настоящее время. Детали протокола IPv6 приведены в <xref linkend="sect.ipv6" />, но основные идеи останутся прежними.

source: <primary>network</primary><secondary>configuration</secondary>
ru_ru: <primary>сеть</primary><secondary>настройка</secondary>

source: <primary>configuration</primary><secondary>of the network</secondary>
ru_ru: <primary>настройка</primary><secondary>сети</secondary>

source: Ethernet Interface
ru_ru: Интерфейс Ethernet

source: DHCP configuration
ru_ru: Настройка DHCP

source: A “static” configuration must indicate network settings in a fixed manner. This includes at least the IP address and subnet mask; network and broadcast addresses are also sometimes listed. A router connecting to the exterior will be specified as a gateway.
ru_ru: Статическая настройка подразумевает фиксированные параметры. Они включают в себя как минимум IP адрес и маску подсети; иногда указываются ещё и широковещательный адрес и адрес сети. Подключаемый ко внешней сети маршрутизатор будет указан в качестве шлюза.

source: Static configuration
ru_ru: Статическая настройка

source: <emphasis>NOTE</emphasis> Multiple addresses
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Множественные адреса

source: It is possible not only to associate several interfaces to a single, physical network card, but also several IP addresses to a single interface. Remember also that an IP address may correspond to any number of names via DNS, and that a name may also correspond to any number of numerical IP addresses.
ru_ru: К одной физической сетевой карте можно привязать несколько сетевых интерфейсов, а одному интерфейсу можно назначить несколько IP адресов. Запомните, что один IP адрес может соответствовать любому количеству имён посредством механизма DNS и одно имя может соответствовать любому количеству числовых IP адресов.

source: As you can guess, the configurations can be rather complex, but these options are only used in very special cases. The examples cited here are typical of the usual configurations.
ru_ru: Как вы уже догадались, настройки могут быть достаточно сложными, но чаще всего подобные варианты используются в особых случаях. Приведённые здесь примеры типичны для обычных конфигураций.

source: Connecting with PPP through a PSTN Modem
ru_ru: Подключение по PPP через PSTN-модем

source: <primary>point to point</primary>
ru_ru: <primary>точка-точка</primary>

source: <primary>connection</primary><secondary>by PSTN modem</secondary>
ru_ru: <primary>подключение</primary><secondary>через PSTN-модем</secondary>

source: <primary>modem</primary><secondary>PSTN</secondary>
ru_ru: <primary>модем</primary><secondary>PSTN</secondary>

source: A point to point (PPP) connection establishes an intermittent connection; this is the most common solution for connections made with a telephone modem (“PSTN modem”, since the connection goes over the public switched telephone network).
ru_ru: Соединение типа “точка-точка” используется для временных подключений; это наиболее распространённый тип подключений посредством телефонных модемов (“PSTN-модемов”, поскольку соединение устанавливается через телефонную сеть общего пользования).

source: After configuration, it is possible to connect using the <command>pon</command> command (giving it the name of the connection as a parameter, when the default value of <literal>provider</literal> is not appropriate). The link is disconnected with the <command>poff</command> command. These two commands can be executed by the root user, or by any other user, provided they are in the <literal>dip</literal> group.
ru_ru: После настройки соединение устанавливается командой <command>pon</command> (которой в качестве параметра передаётся имя соединения в том случае, когда значение по умолчанию <literal>provider</literal> неприменимо). Установленное соединение разрывается командой <command>poff</command>. Эти две команды выполняются суперпользователем или любым другим пользователем из группы <literal>dip</literal>.

source: <emphasis>TOOL</emphasis> On-demand connection with <command>diald</command>
ru_ru: <emphasis>ИНСТРУМЕНТ</emphasis> Установление соединения по запросу с помощью <command>diald</command>
