Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: For this purpose, it is enough to use the <command>vipw</command> command to edit the <filename>/etc/passwd</filename> file, or <command>vigr</command> to edit <filename>/etc/group</filename>. These commands lock the file in question prior to running the text editor, (<command>vi</command> by default, unless the <varname>EDITOR</varname> environment variable has been altered). The <literal>-s</literal> option in these commands allows editing the corresponding <foreignphrase>shadow</foreignphrase> file.
ru_ru: В этих целях достаточно использовать команду <command>vipw</command> для редактирования файла <filename>/etc/passwd</filename> или <command>vigr</command> для редактирования <filename>/etc/group</filename>. Эти команды блокируют доступ к соответствующим файлам до запуска текстового редактора (<command>vi</command> по умолчанию, если переменная окружения <varname>EDITOR</varname> не изменялась). Опция <literal>-s</literal> этих команд позволяет редактировать <foreignphrase>теневой</foreignphrase> файл.

source: <emphasis>BACK TO BASICS</emphasis> Crypt, a one-way function
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Crypt - функция однонаправленного преобразования

source: User List: <filename>/etc/passwd</filename>
ru_ru: Список пользователей: <filename>/etc/passwd</filename>

source: Here is the list of fields in the <filename>/etc/passwd</filename> file:
ru_ru: Ниже приведён список полей файла <filename>/etc/passwd</filename>:

source: login, for example <literal>rhertzog</literal>;
ru_ru: имя пользователя, например, <literal>rhertzog</literal>;

source: <literal>uid</literal>: unique number identifying each user;
ru_ru: <literal>uid</literal>: уникальный номер, идентифицирующий каждого пользователя;

source: <literal>gid</literal>: unique number for the user's main group (Debian creates a specific group for each user by default);
ru_ru: <literal>gid</literal>: уникальный номер для основной группы пользователя (Debian создаёт отдельную группу для каждого пользователя по умолчанию);

source: <literal>GECOS</literal>: data field usually containing the user's full name;
ru_ru: <literal>GECOS</literal>: поле данных, в котором обычно содержится полное имя пользователя;

source: login directory, assigned to the user for storage of their personal files (the environment variable <varname>$HOME</varname> generally points here);
ru_ru: каталог учётной записи, создаваемый для хранения персональных файлов пользователя (с этим каталогом обычно связана переменная окружения <varname>$HOME</varname>);

source: <emphasis>BACK TO BASICS</emphasis> Unix group
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Группа в Unix

source: The Hidden and Encrypted Password File: <filename>/etc/shadow</filename>
ru_ru: Скрытый и зашифрованный файл паролей: <filename>/etc/shadow</filename>

source: <primary><filename>shadow</filename></primary>
ru_ru: <primary><filename>теневой</filename></primary>

source: The <filename>/etc/shadow</filename> file contains the following fields:
ru_ru: Файл <filename>/etc/shadow</filename> содержит следующие поля:

source: encrypted password;
ru_ru: зашифрованный пароль;

source: several fields managing password expiration.
ru_ru: несколько полей, отвечающих за истечение срока действия пароля.

source: <emphasis>DOCUMENTATION</emphasis> <filename>/etc/passwd</filename>, <filename>/etc/shadow</filename> and <filename>/etc/group</filename> file formats
ru_ru: <emphasis>ДОКУМЕНТАЦИЯ</emphasis> Форматы файлов <filename>/etc/passwd</filename>, <filename>/etc/shadow</filename> и <filename>/etc/group</filename>

source: These formats are documented in the following man pages: <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry>, and <citerefentry><refentrytitle>group</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
ru_ru: Документация по форматам этих файлов содержится на следующих страницах руководств: <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> и <citerefentry><refentrytitle>group</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: <emphasis>SECURITY</emphasis> <filename>/etc/shadow</filename> file security
ru_ru: <emphasis>БЕЗОПАСНОСТЬ</emphasis> Безопасность файла <filename>/etc/shadow</filename>

source: <filename>/etc/shadow</filename>, unlike its alter-ego, <filename>/etc/passwd</filename>, cannot be read by regular users. Any encrypted password stored in <filename>/etc/passwd</filename> is readable by anybody; a cracker could try to “break” (or reveal) a password by one of several “brute force” methods which, simply put, guess at commonly used combinations of characters. This attack — called a "dictionary attack" — is no longer possible on systems using <filename>/etc/shadow</filename>.
ru_ru: <filename>/etc/shadow</filename>, в отличие от своего второго “я”, <filename>/etc/passwd</filename>, не может быть открыт для чтения обычным пользователем. Все незашифрованные пароли из файла <filename>/etc/passwd</filename> доступны для чтения всем пользователям; злоумышленник может попытаться “взломать” (или раскрыть) пароль одним из методов “грубой силы”, проще говоря, подобрать наиболее часто встречающиеся комбинации символов. Данный вид атаки, называемый атакой по словарю, невозможен на тех системах, где используется <filename>/etc/shadow</filename>.

source: Modifying an Existing Account or Password
ru_ru: Изменение существующей учётной записи или пароля

source: The following commands allow modification of the information stored in specific fields of the user databases: <command>passwd</command> permits a regular user to change their password, which in turn, updates the <filename>/etc/shadow</filename> file; <command>chfn</command> (CHange Full Name), reserved for the super-user (root), modifies the <literal>GECOS</literal> field. <command>chsh</command> (CHange SHell) allows the user to change their login shell, however available choices will be limited to those listed in <filename>/etc/shells</filename>; the administrator, on the other hand, is not bound by this restriction and can set the shell to any program of their choosing.
ru_ru: Следующие команды помогут вам изменить информацию, хранящуюся в определённых полях базы данных пользователей: <command>passwd</command> позволит обычному пользователю изменить свой пароль, после чего она обновит содержимое файла <filename>/etc/shadow</filename>; <command>chfn</command> (CHange Full Name, изменить полное имя) зарезервирована для администратора и позволяет ему изменять поле <literal>GECOS</literal>; <command>chsh</command> (CHange SHell, изменить оболочку) позволяет пользователю изменить командный интерпретатор своей учётной записи, однако выбор таковых будет ограничен списком из файла <filename>/etc/shells</filename>; администратор же не ограничен выбором из данного списка и может установить любой командный интерпретатор по своему выбору.

source: Finally, the <command>chage</command> (CHange AGE) command allows the administrator to change the password expiration settings (the <literal>-l <replaceable>user</replaceable></literal> option will list the current settings). You can also force the expiration of a password using the <command>passwd -e <replaceable>user</replaceable></command> command, which will require the user to change their password the next time they log in.
ru_ru: Наконец, <command>chage</command> (CHange AGE, изменить возраст) позволяет администратору модифицировать настройки срока действия пароля (опция <literal>-l <replaceable>user</replaceable></literal> позволит отобразить текущие настройки). Вы также можете принудительно завершить действие пароля с помощью команды <command>passwd -e <replaceable>user</replaceable></command>, что потребует от пользователя смены пароля при следующей регистрации в системе.

source: Disabling an Account
ru_ru: Отмена учётной записи

source: <primary>Disable an account</primary>
ru_ru: <primary>Отмена учётной записи</primary>

source: <primary>account</primary><secondary>disable</secondary>
ru_ru: <primary>учётная запись</primary><secondary>отменить</secondary>

source: You may find yourself needing to “disable an account” (lock out a user), as a disciplinary measure, for the purposes of an investigation, or simply in the event of a prolonged or definitive absence of a user. A disabled account means the user cannot login or gain access to the machine. The account remains intact on the machine and no files or data are deleted; it is simply inaccessible. This is accomplished by using the command <command>passwd -l <replaceable>user</replaceable></command> (lock). Re-enabling the account is done in similar fashion, with the <literal>-u</literal> option (unlock).
ru_ru: Иногда у вас может возникнуть необходимость в отмене учётной записи пользователя (заблокировать пользователя) в дисциплинарных целях, с целью проведения какого-либо расследования или просто в связи с длительным отсутствием пользователя. Заблокированная учётная запись приводит к тому, что пользователь не может получить доступ к машине. Учётная запись при этом остаётся действительной и файлы пользователя не удаляются, они просто становятся недоступными. Для этого существует команда <command>passwd -l <replaceable>user</replaceable></command> (lock, заблокировать). Разблокировка учётной записи выполняется аналогично опцией <literal>-u</literal> (unlock, разблокировать).

source: <emphasis>GOING FURTHER</emphasis> NSS and system databases
ru_ru: <emphasis>УГЛУБЛЯЕМСЯ</emphasis> NSS и системные базы данных

source: <primary>Name Service Switch</primary>
ru_ru: <primary>Диспетчер службы имён</primary>

source: Instead of using the usual files to manage lists of users and groups, you could use other types of databases, such as LDAP or <command>db</command>, by using an appropriate NSS (Name Service Switch) module. The modules used are listed in the <filename>/etc/nsswitch.conf</filename> file, under the <literal>passwd</literal>, <literal>shadow</literal> and <literal>group</literal> entries. See <xref linkend="sect.config-nss" /> for a specific example of the use of an NSS module by LDAP.
ru_ru: Вместо использования традиционных файлов для управления группам и списками пользователей вы можете воспользоваться другими типами баз данных, такими как LDAP или <command>db</command>, с помощью модулей NSS (диспетчера службы имён). Используемые модули перечислены в файле <filename>/etc/nsswitch.conf</filename> в разделах <literal>passwd</literal>, <literal>shadow</literal> и <literal>group</literal>. Более подробный пример использования модуля NSS в LDAP смотрите в <xref linkend="sect.config-nss" />.

source: Group List: <filename>/etc/group</filename>
ru_ru: Список групп: <filename>/etc/group</filename>

source: Groups are listed in the <filename>/etc/group</filename> file, a simple textual database in a format similar to that of the <filename>/etc/passwd</filename> file, with the following fields:
ru_ru: Группы пользователей перечислены в файле <filename>/etc/group</filename>, который является простой текстовой базой данных схожего с <filename>/etc/passwd</filename> формата и имеет следующие поля:

source: password (optional): This is only used to join a group when one is not a usual member (with the <command>newgrp</command> or <command>sg</command> commands, see sidebar);
ru_ru: пароль (необязательно): это поле используется в случае временного присоединения к группе пользователя, не являющегося её постоянным членом (командами <command>newgrp</command> или <command>sg</command>, см. врезку);

source: list of members: list of names of users who are members of the group, separated by commas.
ru_ru: список членов группы: список тех пользователей, которые входят в группу, имена разделяются запятыми.

source: <emphasis>BACK TO BASICS</emphasis> Working with several groups
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Работа с несколькими группами

source: <primary>group</primary><secondary>change</secondary>
ru_ru: <primary>группа</primary><secondary>изменить</secondary>

source: Each user may be a member of many groups; one of them is their “main group”. A user's main group is, by default, created during initial user configuration. By default, each file that a user creates belongs to them, as well as to their main group. This is not always desirable; for example, when the user needs to work in a directory shared by a group other than their main group. In this case, the user needs to change their main group using one of the following commands: <command>newgrp</command>, which starts a new shell, or <command>sg</command>, which simply executes a command using the supplied alternate group. These commands also allow the user to join a group to which they do not belong. If the group is password protected, they will need to supply the appropriate password before the command is executed.
ru_ru: Каждый пользователь может быть членом нескольких групп, но только одна из них является “основной группой”. Основная группа создаётся по умолчанию при первоначальной настройке профиля пользователя. Каждый файл, созданный пользователем, принадлежит как ему, так и его основной группе. Такое поведение не всегда желательно, например, когда пользователю необходимо работать в каталоге, отличном от каталога его основной группы. В этом случае пользователю стоит изменить свою основную группу одной из следующих команд: <command>newgrp</command>, которая запускает новую оболочку, или <command>sg</command>, которая просто выполняет какую-либо команду с использованием альтернативной группы. Данные команды позволяют пользователю присоединиться даже к тем группам, членом которых он не является. Если же группа защищена паролем, то команда будет выполнена только после его ввода.

source: Alternatively, the user can set the <literal>setgid</literal> bit on the directory, which causes files created in that directory to automatically belong to the correct group. For more details, see sidebar <xref linkend="sidebar.setgid-dir" />.
ru_ru: Или же пользователь может установить для каталога бит <literal>setgid</literal>, что позволит автоматически устанавливать необходимую группу для всех файлов, создаваемых в этом каталоге. Подробности см. во врезке <xref linkend="sidebar.setgid-dir" />.

source: The <command>id</command> command displays the current state of a user, with their personal identifier (<varname>uid</varname> variable), current main group (<varname>gid</varname> variable), and the list of groups to which they belong (<varname>groups</varname> variable).
ru_ru: Команда <command>id</command> отображает текущий статус пользователя, содержащий его персональный идентификатор (переменная <varname>uid</varname>), текущую основную группу (переменная <varname>gid</varname>) и список тех групп, в которые входит пользователь (переменная <varname>groups</varname>).

source: <primary><filename>group</filename></primary>
ru_ru: <primary><filename>группа</filename></primary>

source: The <command>addgroup</command> and <command>delgroup</command> commands add or delete a group, respectively. The <command>groupmod</command> command modifies a group's information (its <literal>gid</literal> or identifier). The command <command>passwd -g <replaceable>group</replaceable></command> changes the password for the group, while the <command>passwd -r -g <replaceable>group</replaceable></command> command deletes it.
ru_ru: Команды <command>addgroup</command> и <command>delgroup</command> соответственно добавляют или удаляют группу. Команда <command>groupmod</command> позволяет изменить информацию о группе (её <literal>gid</literal> или идентификатор). Команда <command>passwd -g <replaceable>group</replaceable></command> изменяет пароль группы, в то время как <command>passwd -r -g <replaceable>group</replaceable></command> позволит вам удалить его.

source: <primary>group</primary><secondary>creation</secondary>
ru_ru: <primary>группы</primary><secondary>создание</secondary>

source: <primary>creation</primary><secondary>of groups</secondary>
ru_ru: <primary>создание</primary><secondary>групп</secondary>

source: <primary>group</primary><secondary>deletion</secondary>
ru_ru: <primary>группы</primary><secondary>удаление</secondary>

source: <primary>deletion of a group</primary>
ru_ru: <primary>удаление группы</primary>

source: <emphasis>TIP</emphasis> <command>getent</command>
ru_ru: <emphasis>СОВЕТ</emphasis> <command>getent</command>

source: The <command>getent</command> (get entries) command checks the system databases the standard way, using the appropriate library functions, which in turn call the NSS modules configured in the <filename>/etc/nsswitch.conf</filename> file. The command takes one or two arguments: the name of the database to check, and a possible search key. Thus, the command <command>getent passwd rhertzog</command> will give the information from the user database regarding the user <literal>rhertzog</literal>.
ru_ru: Команда <command>getent</command> (извлечь записи) выполняет стандартный запрос к системным базам данных с использованием соответствующих библиотечных функций, которые в свою очередь обращаются к модулям NSS, указанным в файле <filename>/etc/nsswitch.conf</filename>. Эта команда принимает один или два аргумента: имя базы данных, к которой выполняется запрос, и возможный ключ поиска. Таким образом, команда <command>getent passwd rhertzog</command> предоставит информацию о пользователе <literal>rhertzog</literal> из базы данных пользователей.

source: Creating Accounts
ru_ru: Создание учётных записей

source: <primary>account</primary><secondary>creation</secondary>
ru_ru: <primary>учётная запись</primary><secondary>создание</secondary>

source: <primary>creation</primary><secondary>of user accounts</secondary>
ru_ru: <primary>создание</primary><secondary>учётных записей пользователей</secondary>

source: One of the first actions an administrator needs to do when setting up a new machine is to create user accounts. This is typically done using the <command>adduser</command> command which takes a user-name for the new user to be created, as an argument.
ru_ru: Создание учётных записей пользователей - это одна из первых операций, производимых администраторами при настройке новой машины. Обычно она выполняется командой <command>adduser</command>, которая в качестве аргумента принимает имя создаваемого пользователя.

source: The <command>adduser</command> command asks a few questions before creating the account, but its usage is fairly straightforward. Its configuration file, <filename>/etc/adduser.conf</filename>, includes all the interesting settings: it can be used to automatically set a quota for each new user by creating a user template, or to change the location of user accounts; the latter is rarely useful, but it comes in handy when you have a large number of users and want to divide their accounts over several disks, for instance. You can also choose a different default shell.
ru_ru: <command>adduser</command> задаст несколько вопросов до создания учётной записи, но пользоваться ей очень просто. Конфигурационный файл, <filename>/etc/adduser.conf</filename>, содержит все заслуживающие внимания настройки: в нем можно установить квоты для новых пользователей через создание профилей или изменить местоположение домашних каталогов; последнее редко используется, но может быть полезным в том случае, когда в системе заведено много пользователей, и вы хотите распределить их каталоги по нескольким дискам. Вы также можете изменить оболочку по умолчанию.

source: <emphasis>BACK TO BASICS</emphasis> Quota
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Квота

source: <primary>quota</primary>
ru_ru: <primary>квота</primary>

source: The term “quota” refers to a limit on machine resources that a user is allowed to use. This frequently refers to disk space.
ru_ru: Термин “квота” относится к ограничению доступных пользователю ресурсов машины. Квоты чаще всего устанавливаются на дисковое пространство.

source: The creation of an account populates the user's home directory with the contents of the <filename>/etc/skel/</filename> template. This provides the user with a set of standard directories and configuration files.
ru_ru: При создании учётной записи в домашний каталог пользователя копируется содержимое <filename>/etc/skel/</filename>. Таким образом пользователю предоставляется набор стандартных каталогов и конфигурационных файлов.

source: <primary>group</primary><secondary>add a user</secondary>
ru_ru: <primary>группа</primary><secondary>добавить пользователя</secondary>

source: <primary>add a user to a group</primary>
ru_ru: <primary>добавить пользователя в группу</primary>

source: In some cases, it will be useful to add a user to a group (other than their default “main” group) in order to grant them additional permissions. For example, a user who is included in the <emphasis>audio</emphasis> group can access audio devices (see sidebar “Device access permissions”). This can be achieved with a command such as <command>adduser <replaceable>user</replaceable> <replaceable>group</replaceable></command>.
ru_ru: В некоторых случаях возникает необходимость добавить пользователя в группу (отличную от основной группы) с целью предоставления ему дополнительных прав. Например, пользователь, включённый в группу <emphasis>audio</emphasis>, имеет доступ к аудио устройствам (см. врезку “Права доступа к устройствам”). Это можно сделать командой <command>adduser <replaceable>user</replaceable> <replaceable>group</replaceable></command>.

source: <emphasis>BACK TO BASICS</emphasis> Device access permissions
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Права доступа к устройствам

source: <primary>device</primary><secondary>access permissions</secondary>
ru_ru: <primary>устройство</primary><secondary>права доступа</secondary>

source: <primary>file</primary><secondary>special</secondary>
ru_ru: <primary>файл</primary><secondary>специальный</secondary>

source: <primary>mode</primary><secondary>character</secondary>
ru_ru: <primary>режим</primary><secondary>символьный</secondary>

source: <primary>mode</primary><secondary>block</secondary>
ru_ru: <primary>режим</primary><secondary>блочный</secondary>

source: <primary>block, mode</primary>
ru_ru: <primary>блочный, режим</primary>

source: <primary>character, mode</primary>
ru_ru: <primary>символьный, режим</primary>

source: <primary>special, file</primary>
ru_ru: <primary>специальный, файл</primary>
