Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: <primary>point, mount</primary>
ru_ru: <primary>монтирование, точка</primary>

source: <primary>mount point</primary>
ru_ru: <primary>точка монтирования</primary>

source: <emphasis>BACK TO BASICS</emphasis> Mounting and unmounting
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Монтирование и размонтирование

source: In a Unix-like system such as Debian, files are organized in a single tree-like hierarchy of directories. The <filename>/</filename> directory is called the “root directory”; all additional directories are sub-directories within this root. “Mounting” is the action of including the content of a peripheral device (often a hard drive) into the system's general file tree. As a consequence, if you use a separate hard drive to store users' personal data, this disk will have to be “mounted” in the <filename>/home/</filename> directory. The root filesystem is always mounted at boot by the kernel; other devices are often mounted later during the startup sequence or manually with the <command>mount</command> command.
ru_ru: В таких Unix-подобных системах, как Debian, файлы организованы в виде древовидной структуры. Каталог <filename>/</filename> называется “корневым каталогом”, а все остальные каталоги составляют вложенную структуру. Монтирование - процесс включения содержимого периферийного устройства (часто это жёсткий диск) в файловую структуру системы. Как следствие, в случае хранения пользовательских данных на отдельном жёстком диске этот диск необходимо примонтировать в каталог <filename>/home/</filename>. Ядро всегда монтирует корневую файловую систему во время загрузки, прочие устройства зачастую монтируются на более поздних этапах загрузки или могут быть примонтированы вручную командой <command>mount</command>.

source: Some removable devices are automatically mounted when connected, especially when using the GNOME, KDE or other graphical desktop environments. Others have to be mounted manually by the user. Likewise, they must be unmounted (removed from the file tree). Normal users do not usually have permission to execute the <command>mount</command> and <command>umount</command> commands. The administrator can, however, authorize these operations (independently for each mount point) by including the <literal>user</literal> option in the <filename>/etc/fstab</filename> file.
ru_ru: Некоторые извлекаемые устройства монтируются автоматически при подключении, и такое поведение характерно для GNOME, KDE и других графических окружений рабочего стола. Все остальные устройства пользователь монтирует в ручном режиме. Размонтирование (удаление из файловой структуры) производится таким же образом. Обычные пользователи в большинстве случаев не имеют прав на выполнение команд <command>mount</command> и <command>umount</command>. Однако администратор может разрешить эти действия (независимо для каждой точки монтирования), установив опцию <literal>user</literal> в файле <filename>/etc/fstab</filename>.

source: The <command>mount</command> command can be used without arguments (it then lists all mounted filesystems). The following parameters are required to mount or unmount a device. For the complete list, please refer to the corresponding man pages, <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>umount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. For simple cases, the syntax is simple too: for example, to mount the <filename>/dev/sdc1</filename> partition, which has an ext3 filesystem, into the <filename>/mnt/tmp/</filename> directory, you would simply run <command>mount -t ext3 /dev/sdc1 /mnt/tmp/</command>.
ru_ru: Команду <command>mount</command> можно использовать без аргументов, в этом случае она выведет список всех примонтированных файловых систем. Монтирование и размонтирование устройств требует передачи параметров этой команде. За полным списком параметров обратитесь к соответствующим станицам руководств: <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> и <citerefentry><refentrytitle>umount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Синтаксис этих команд достаточно прост в некоторых случаях, например, примонтировать раздел <filename>/dev/sdc1</filename>, содержащий файловую систему ext3, в каталог <filename>/mnt/tmp/</filename> можно командой <command>mount -t ext3 /dev/sdc1 /mnt/tmp/</command>.

source: The <filename>/etc/fstab</filename> file gives a list of all possible mounts that happen either automatically on boot or manually for removable storage devices. Each mount point is described by a line with several space-separated fields: <indexterm><primary><filename>fstab</filename></primary></indexterm> <indexterm><primary><filename>/etc/fstab</filename></primary></indexterm>
ru_ru: В файле <filename>/etc/fstab</filename> перечислены все возможные точки монтирования, которые подключаются либо автоматически при загрузке, либо вручную в случае каких-либо извлекаемых устройств. Каждая точка монтирования описывается одной строкой, состоящей из нескольких разделённых пробелами полей: <indexterm><primary><filename>fstab</filename></primary></indexterm> <indexterm><primary><filename>/etc/fstab</filename></primary></indexterm>

source: device to mount: this can be a local partition (hard drive, CD-ROM) or a remote filesystem (such as NFS).
ru_ru: монтируемое устройство: им может быть локальный раздел (на жёстком диске, CD-ROM) или удалённая файловая система (как NFS).

source: This field is frequently replaced with the unique ID of the filesystem (which you can determine with <command>blkid <userinput>device</userinput></command>) prefixed with <literal>UUID=</literal>. This guards against a change in the name of the device in the event of addition or removal of disks, or if disks are detected in a different order.
ru_ru: Это поле часто содержит уникальный идентификатор файловой системы (его можно узнать командой <command>blkid <userinput>device</userinput></command>), которому предшествует <literal>UUID=</literal>. Такие идентификаторы удобны в случае добавления или удаления устройств, а также при изменении порядка определения устройств, поскольку имя устройства останется неизменным.

source: mount point: this is the location on the local filesystem where the device, remote system, or partition will be mounted.
ru_ru: точка монтирования: путь в локальной файловой системе, по которому монтируется устройство, удалённая файловая система или раздел.

source: <emphasis>BACK TO BASICS</emphasis> NFS, a network filesystem
ru_ru: <emphasis>К ОСНОВАМ</emphasis> NFS, сетевая файловая система

source: NFS is a network filesystem; under Linux, it allows transparent access to remote files by including them in the local filesystem.
ru_ru: NFS является сетевой файловой системой. В GNU/Linux через неё организуется прозрачный доступ к файлам на удалённых машинах путём их включения в локальную файловую систему.

source: A complete list of known filesystems is available in the <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry> man page. The <literal>swap</literal> special value is for swap partitions; the <literal>auto</literal> special value tells the <command>mount</command> program to automatically detect the filesystem (which is especially useful for disk readers and USB keys, since each one might have a different filesystem);
ru_ru: Полный список известных файловых систем приведён на странице руководства <citerefentry><refentrytitle>mount</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Специальное значение <literal>swap</literal> зарезервировано для разделов подкачки, а значение <literal>auto</literal> укажет программе <command>mount</command> на необходимость автоматического определения типа файловой системы (что особенной удобно для устройств чтения дисков и USB-накопителей, поскольку каждое из них может содержать различные файловые системы).

source: options: there are many of them, depending on the filesystem, and they are documented in the <command>mount</command> man page. The most common are
ru_ru: опции: для каждого типа файловой системы существуют свои, и они описаны на странице руководства <command>mount</command>. Наиболее употребляемыми привилегиями являются

source: <literal>rw</literal> or <literal>ro</literal>, meaning, respectively, that the device will be mounted with read/write or read-only permissions.
ru_ru: <literal>rw</literal> или <literal>ro</literal>, которые означают, что устройство будет смонтировано для чтения/записи или только для чтения соответственно.

source: <literal>noauto</literal> deactivates automatic mounting on boot.
ru_ru: <literal>noauto</literal> отключает автоматическое монтирование при загрузке.

source: <literal>user</literal> authorizes all users to mount this filesystem (an operation which would otherwise be restricted to the root user).
ru_ru: <literal>user</literal> позволяет всем пользователям монтировать эту файловую систему (в противном случае эта операция доступна только администратору).

source: <literal>defaults</literal> means the group of default options: <literal>rw</literal>, <literal>suid</literal>, <literal>dev</literal>, <literal>exec</literal>, <literal>auto</literal>, <literal>nouser</literal> and <literal>async</literal>, each of which can be individually disabled after <literal>defaults</literal> by adding <literal>nosuid</literal>, <literal>nodev</literal> and so on to block <literal>suid</literal>, <literal>dev</literal> and so on. Adding the <literal>user</literal> option reactivates it, since <literal>defaults</literal> includes <literal>nouser</literal>.
ru_ru: <literal>defaults</literal> подразумевает группу опций по умолчанию: <literal>rw</literal>, <literal>suid</literal>, <literal>dev</literal>, <literal>exec</literal>, <literal>auto</literal>, <literal>nouser</literal> и <literal>async</literal>, каждая из которых может быть индивидуально отключена после <literal>defaults</literal> добавлением <literal>nosuid</literal>, <literal>nodev</literal> и так далее для блокировки <literal>suid</literal>, <literal>dev</literal> и так далее. Добавление опции <literal>user</literal> активирует её, поскольку <literal>defaults</literal> содержит <literal>nouser</literal>.

source: backup: this field is almost always set to <literal>0</literal>. When it is <literal>1</literal>, it tells the <command>dump</command> tool that the partition contains data that is to be backed up.
ru_ru: резервирование: в абсолютном большинстве случаев это поле будет содержать <literal>0</literal>. Значение <literal>1</literal> в этом поле указывает программе <command>dump</command> на наличие данных, которые необходимо резервировать.

source: check order: this last field indicates whether the integrity of the filesystem should be checked on boot, and in which order this check should be executed. If it is <literal>0</literal>, no check is conducted. The root filesystem should have the value <literal>1</literal>, while other permanent filesystems get the value <literal>2</literal>.
ru_ru: порядок проверки: в последнем поле указывается порядок проведения проверки целостности файловой системы при загрузке, а также очерёдность проверки. Если это поле имеет значение <literal>0</literal>, то проверка не выполняется. Для корневой файловой системы следует указывать значение <literal>1</literal>, а для прочих постоянных файловых систем - <literal>2</literal>.

source: Example <filename>/etc/fstab</filename> file:
ru_ru: Пример файла <filename>/etc/fstab</filename> file:

source: The last entry in this example corresponds to a network filesystem (NFS): the <filename>/shared/</filename> directory on the <emphasis>arrakis</emphasis> server is mounted at <filename>/shared/</filename> on the local machine. The format of the <filename>/etc/fstab</filename> file is documented on the <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry> man page.
ru_ru: Последняя запись в вышеприведённом примере соответствует сетевой файловой системе (NFS): каталог <filename>/shared/</filename> сервера <emphasis>arrakis</emphasis> монтируется в <filename>/shared/</filename> на локальной машине. Формат файла <filename>/etc/fstab</filename> описан на странице руководства <citerefentry><refentrytitle>fstab</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: <emphasis>GOING FURTHER</emphasis> Auto-mounting
ru_ru: <emphasis>УГЛУБЛЯЕМСЯ</emphasis> Автоматическое монтирование

source: The <emphasis>am-utils</emphasis> package provides the <command>amd</command> auto-mounting utility, able to mount removable media on demand when a user attempts to access their usual mount point. It will unmount these devices when no process is accessing them any longer.
ru_ru: Пакет <emphasis>am-utils</emphasis> содержит утилиту автоматического монтирования <command>amd</command>, которая может примонтировать извлекаемое устройство при первой попытке доступа к его точке монтирования. Она также может отмонтировать устройства, которые ни один процесс больше не использует.

source: Other auto-mounting utilities exist, such as <command>automount</command> in the <emphasis>autofs</emphasis> package.
ru_ru: Существуют и другие утилиты автомонтирования, например, <command>automount</command> из пакета <emphasis>autofs</emphasis>.

source: <command>locate</command> and <command>updatedb</command>
ru_ru: <command>locate</command> и <command>updatedb</command>

source: Compiling a Kernel
ru_ru: Сборка ядра

source: <primary>compilation</primary><secondary>of a kernel</secondary>
ru_ru: <primary>сборка</primary><secondary>ядра</secondary>

source: <primary>kernel</primary><secondary>compilation</secondary>
ru_ru: <primary>ядро</primary><secondary>сборка</secondary>

source: The kernels provided by Debian include the largest possible number of features, as well as the maximum of drivers, in order to cover the broadest spectrum of existing hardware configurations. This is why some users prefer to recompile the kernel in order to only include what they specifically need. There are two reasons for this choice. First, it may be to optimize memory consumption, since the kernel code, even if it is never used, occupies memory for nothing (and never “goes down” on the swap space, since it is actual RAM that it uses), which can decrease overall system performance. A locally compiled kernel can also limit the risk of security problems since only a fraction of the kernel code is compiled and run.
ru_ru: Ядра, поставляемые Debian, включают в себя максимально возможное количество функций и драйверов с целью охвата самого широкого спектра аппаратных конфигураций. По этой причине некоторые пользователи предпочитают пересобрать ядро под собственные нужды. В целом, существуют две причины, по которым стоит пересобрать ядро. Во-первых, это делается с целью оптимизации потребления оперативной памяти, поскольку код ядра постоянно занимает память, даже если какая-то часть его не используется (и он не выгружается в пространство подкачки), что, в свою очередь, может уменьшить общую производительность системы. Во-вторых, локально собранное ядро уменьшает риск возникновения проблем с безопасностью, так как реально используется только часть ядра.

source: <emphasis>NOTE</emphasis> Security updates
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Обновления безопасности

source: Recompilation of the kernel is also necessary if you want to use certain features that are only available as patches (and not included in the standard kernel version).
ru_ru: Пересборка ядра необходима и в том случае, когда вам потребуются какие-либо функции, доступные только в виде заплат для ядра (и не включённые в стандартную версию ядра).

source: Introduction and Prerequisites
ru_ru: Введение и предварительные требования

source: Getting the Sources
ru_ru: Получение исходных текстов

source: <primary>Linux kernel sources</primary>
ru_ru: <primary>Исходные тексты ядра Linux</primary>

source: <primary>kernel</primary><secondary>sources</secondary>
ru_ru: <primary>ядро</primary><secondary>исходные тексты</secondary>

source: <emphasis>CULTURE</emphasis> Location of kernel sources
ru_ru: <emphasis>КУЛЬТУРА</emphasis> Расположение исходных кодов ядра

source: Configuring the Kernel
ru_ru: Настройка ядра

source: <primary>kernel</primary><secondary>configuration</secondary>
ru_ru: <primary>ядро</primary><secondary>настройка</secondary>

source: <primary>configuration</primary><secondary>of the kernel</secondary>
ru_ru: <primary>настройка</primary><secondary>ядра</secondary>

source: The next step consists of configuring the kernel according to your needs. The exact procedure depends on the goals.
ru_ru: Следующим шагом будет настройка ядра в соответствии с вашими потребностями. Выполнение данной задачи зависит от поставленных целей.

source: When recompiling a more recent version of the kernel (possibly with an additional patch), the configuration will most likely be kept as close as possible to that proposed by Debian. In this case, and rather than reconfiguring everything from scratch, it is sufficient to copy the <filename>/boot/config-<replaceable>version</replaceable></filename> file (the version is that of the kernel currently used, which can be found with the <command>uname -r</command> command) into a <filename>.config</filename> file in the directory containing the kernel sources.
ru_ru: При сборке более поздней версии ядра (возможно, что оно с дополнительными заплатами) вы, вероятно, оставите большинство настроек в том виде, в каком они рекомендованы Debian. В таком случае не стоит перенастраивать всё заново, достаточно скопировать файл <filename>/boot/config-<replaceable>version</replaceable></filename> в <filename>.config</filename> в каталоге, содержащем исходные коды ядра (версия файла должна совпадать с версией текущего ядра, которую можно узнать командой <command>uname -r</command>).

source: Unless you need to change the configuration, you can stop here and skip to the next section. If you need to change it, on the other hand, or if you decide to reconfigure everything from scratch, you must take the time to configure your kernel. There are various dedicated interfaces in the kernel source directory that can be used by calling the <command>make <replaceable>target</replaceable></command> command, where <replaceable>target</replaceable> is one of the values described below.
ru_ru: Если у вас нет необходимости изменять конфигурацию, то вы можете перейти к следующему разделу. В противном случае, а также если вы решили переписать конфигурацию с самого начала, сейчас самое время заняться настройкой ядра. В каталоге с исходными кодами ядра находятся несколько специализированных интерфейсов, которые можно вызвать командой <command>make <replaceable>target</replaceable></command>, где <replaceable>target</replaceable> является одним из приведённых ниже значений.

source: Compiling and Building the Package
ru_ru: Компиляция и сборка пакета

source: <emphasis>NOTE</emphasis> Clean up before rebuilding
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Очистка перед повторной сборкой

source: Compiling External Modules
ru_ru: Компиляция внешних модулей

source: <primary>kernel</primary><secondary>external modules</secondary>
ru_ru: <primary>ядро</primary><secondary>внешние модули</secondary>

source: These external packages are many and varied and we won't list them all here; the <command>apt-cache search source$</command> command can narrow down the search field. However, a complete list isn't particularly useful since there is no particular reason for compiling external modules except when you know you need it. In such cases, the device's documentation will typically detail the specific module(s) it needs to function under Linux.
ru_ru: Существует достаточно много различных сторонних пакетов, но мы не будем перечислять их здесь; команда <command>apt-cache search source$</command> поможет вам значительно сократить область поиска. Более того, полный список модулей не особо полезен, поскольку вам вряд ли придётся их компилировать за исключением тех случаев, когда они действительно потребуются. В документации на устройства обычно указываются специальные модули, которые необходимы для работы устройства в Linux.

source: Applying a Kernel Patch
ru_ru: Применение заплаты для ядра

source: <primary>kernel</primary><secondary>patch</secondary>
ru_ru: <primary>ядро</primary><secondary>заплата</secondary>

source: Debian distributes some of these patches in <emphasis role="pkg">linux-patch-*</emphasis> or <emphasis role="pkg">kernel-patch-*</emphasis> packages (for instance, <emphasis role="pkg">linux-patch-grsecurity2</emphasis>, which tightens some of the kernel's security policies). These packages install files in the <filename>/usr/src/kernel-patches/</filename> directory.
ru_ru: Debian поставляет некоторые заплаты в пакетах <emphasis role="pkg">linux-patch-*</emphasis> или <emphasis role="pkg">kernel-patch-*</emphasis> (например, <emphasis role="pkg">linux-patch-grsecurity2</emphasis> усиливает некоторые политики безопасности ядра). Такие пакеты устанавливают файлы в каталог <filename>/usr/src/kernel-patches/</filename>.

source: To apply one or more of these installed patches, use the <command>patch</command> command in the sources directory then start compilation of the kernel as described above.
ru_ru: Используйте команду <command>patch</command> в каталоге с исходными кодами для наложения одной или нескольких заплат, а затем компилируйте ядро по описанной выше процедуре.

source: Note that a given patch may not necessarily work with every version of the kernel; it is possible for <command>patch</command> to fail when applying them to kernel sources. An error message will be displayed and give some details about the failure; in this case, refer to the documentation available in the Debian package of the patch (in the <filename>/usr/share/doc/linux-patch-*/</filename> directory). In most cases, the maintainer indicates for which kernel versions their patch is intended.
ru_ru: Обратите внимание, что отдельные заплаты могут быть несовместимы с некоторыми версиями ядер; <command>patch</command> в таких случаях может завершиться неудачно, при этом будет выведено сообщение об ошибке, содержащее некоторые детали о возникшей проблеме. В таких случаях обращайтесь к документации из пакета с заплатой (в каталоге <filename>/usr/share/doc/linux-patch-*/</filename>). В большинстве случаев сопровождающий указывает версию ядра, для которой предназначена заплата.

source: Installing a Kernel
ru_ru: Установка ядра

source: <primary>installation</primary><secondary>of a kernel</secondary>
ru_ru: <primary>установка</primary><secondary>ядра</secondary>

source: <primary>kernel</primary><secondary>installation</secondary>
ru_ru: <primary>ядро</primary><secondary>установка</secondary>

source: Features of a Debian Kernel Package
ru_ru: Особенности пакета с ядром Debian
