Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: GRUB can only identify hard drives based on information provided by the BIOS. <literal>(hd0)</literal> corresponds to the first disk thus detected, <literal>(hd1)</literal> the second, etc. In most cases, this order corresponds exactly to the usual order of disks under Linux, but problems can occur when you associate SCSI and IDE disks. GRUB stores correspondences that it detects in the file <filename>/boot/grub/device.map</filename>. If you find errors there (because you know that your BIOS detects drives in a different order), correct them manually and run <command>grub-install</command> again.
ru_ru: GRUB определяет жёсткие диски только по той информации, что предоставляет BOIS. <literal>(hd0)</literal> соответствует первому обнаруженному диску, <literal>(hd1)</literal> - второму и т. д. В большинстве случаев такой порядок точно соответствует обычному расположению дисков в системе Linux, но при совместном использовании SCSI и IDE дисков могут возникнуть проблемы. GRUB сохраняет обнаруженные соответствия между дисками и именами в файле <filename>/boot/grub/device.map</filename>. В случае обнаружения ошибок в этом файле (например, вы уверены, что BIOS определяет диски в ином порядке) вы можете исправить их вручную и повторно выполнить команду <command>grub-install</command>.

source: Partitions also have a specific name in GRUB. When you use “classical” partitions in MS-DOS format, the first partition on the first disk is labeled, <literal>(hd0,msdos1)</literal>, the second <literal>(hd0,msdos2)</literal>, etc.
ru_ru: Разделам дисков также присваиваются специальные имена в GRUB. Если вы используете “классические” разделы в формате MS-DOS, то первому разделу на первом диске присваивается метка <literal>(hd0,msdos1)</literal>, второму - <literal>(hd0,msdos2)</literal> и т. д.

source: For Macintosh Computers (PowerPC): Configuring Yaboot
ru_ru: О компьютерах Macintosh (PowerPC): настройка Yaboot

source: Yaboot is the bootloader used by old Macintosh computers using PowerPC processors. They do not boot like PCs, but rely on a “bootstrap” partition, from which the BIOS (or OpenFirmware) executes the loader, and on which the <command>ybin</command> program installs <command>yaboot</command> and its configuration file. You will only need to run this command again if the <filename>/etc/yaboot.conf</filename> is modified (it is duplicated on the bootstrap partition, and <command>yaboot</command> knows how to find the position of the kernels on the disks).
ru_ru: Yaboot - это загрузчик, который использовался в старых компьютерах Macintosh на процессорах PowerPC. Процесс загрузки таких компьютеров отличается от PC тем, что в них используется специальный загрузочный раздел, с которого BIOS (или OpenFirmware) выполняет код загрузчика и на который программа <command>ybin</command> устанавливает <command>yaboot</command> совместно со всеми его конфигурационными файлами. В случае изменения <filename>/etc/yaboot.conf</filename> вам необходимо повторно запустить эту программу (конфигурационный файл при этом копируется на загрузочный раздел и <command>yaboot</command> определяет расположение загружаемых ядер на дисках).

source: Before executing <command>ybin</command>, you must first have a valid <filename>/etc/yaboot.conf</filename>. The following is an example of a minimal configuration. <indexterm><primary><command>ybin</command></primary></indexterm>
ru_ru: Перед запуском <command>ybin</command> вам следует убедиться в корректности <filename>/etc/yaboot.conf</filename>. Ниже приведён пример минимального файла настроек. <indexterm><primary><command>ybin</command></primary></indexterm>

source: Yaboot configuration file
ru_ru: Файл настроек Yaboot

source: The many elements listed in this section are good to know for anyone who wants to master all aspects of configuration of the GNU/Linux system. They are, however, treated briefly and frequently refer to the documentation.
ru_ru: Инструменты, которые упоминаются в этом разделе, полезно изучить любому, кто желает овладеть всеми деталями настройки системы GNU/Linux. Однако эти инструменты освещены кратко и за более подробной информацией следует обратиться к документации.

source: Timezone
ru_ru: Часовой пояс

source: <primary>timezone</primary>
ru_ru: <primary>часовой пояс</primary>

source: <emphasis>BACK TO BASICS</emphasis> Symbolic links
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Символические ссылки

source: <primary>link</primary><secondary>symbolic</secondary>
ru_ru: <primary>ссылка</primary><secondary>символическая</secondary>

source: <primary>symbolic link</primary>
ru_ru: <primary>символическая ссылка</primary>

source: A symbolic link is a pointer to another file. When you access it, the file to which it points is opened. Removal of the link will not cause deletion of the file to which it points. Likewise, it does not have its own set of permissions, but rather retains the permissions of its target. Finally, it can point to any type of file: directories, special files (sockets, named pipes, device files, etc.), even other symbolic links.
ru_ru: Символическая ссылка - это указатель на другой файл. Во время доступа к ссылке открывается тот файл, на который она указывает. Удаление ссылки не влечёт за собой удаление связанного файла. Также ссылки не имеют собственного набора прав доступа, а наследуют права доступа своей цели. Наконец, они могут ссылаться на любой тип файла: каталоги, специальные файлы (сокеты, именованные каналы, файлы устройств и т. д.) и даже на другие символические ссылки.

source: The <command>ln -s <replaceable>target</replaceable> <replaceable>link-name</replaceable></command> command creates a symbolic link, named <replaceable>link-name</replaceable>, pointing to <replaceable>target</replaceable>.
ru_ru: Команда <command>ln -s <replaceable>target</replaceable> <replaceable>link-name</replaceable></command> создаёт символическую ссылку с именем <replaceable>link-name</replaceable>, которая ссылается на <replaceable>target</replaceable>.

source: If the target does not exist, then the link is “broken” and accessing it will result in an error indicating that the target file does not exist. If the link points to another link, you will have a “chain” of links that turns into a “cycle” if one of the targets points to one of its predecessors. In this case, accessing one of the links in the cycle will result in a specific error (“too many levels of symbolic links”); this means the kernel gave up after several rounds of the cycle.
ru_ru: Ссылка считается нерабочей в случае отсутствующего целевого файла и доступ по такой ссылке приведёт к ошибке, которая укажет на то, что целевой файл не существует. Если одна ссылка указывает на другую, то говорят о цепочке ссылок, которая может превратиться в кольцо в том случае, когда одна из целевых ссылок указывает на одну из предшествующих ссылок. Обращение к одной из ссылок в кольце приведёт к специфической ошибке (“слишком большая вложенность символических ссылок”), которая означает, что ядро прекратило попытку разыменовывания ссылки после нескольких циклов обхода кольца.

source: <primary><filename>timezone</filename></primary>
ru_ru: <primary><command>часовой пояс</command></primary>

source: <primary>daylight saving time</primary>
ru_ru: <primary>переход на летнее время</primary>

source: When you need to temporarily change the timezone, use the <varname>TZ</varname> environment variable, which takes priority over the configured system default:
ru_ru: Для временного изменения часового пояса используйте переменную окружения <varname>TZ</varname>, которая имеет более высокий приоритет, чем системные настройки по умолчанию:

source: <emphasis>NOTE</emphasis> System clock, hardware clock
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Системные часы, аппаратные часы

source: There are two time sources in a computer. A computer's motherboard has a hardware clock, called the “CMOS clock”. This clock is not very precise, and provides rather slow access times. The operating system kernel has its own, the software clock, which it keeps up to date with its own means (possibly with the help of time servers, see the “Time Synchronization” section). This system clock is generally more accurate, especially since it doesn't need access to hardware variables. However, since it only exists in live memory, it is zeroed out every time the machine is booted, contrary to the CMOS clock, which has a battery and therefore “survives” rebooting or halting of the machine. The system clock is, thus, set from the CMOS clock during boot, and the CMOS clock is updated on shutdown (to take into account possible changes or corrections if it has been improperly adjusted).
ru_ru: В компьютере существуют два источника времени. На материнской плате установлены аппаратные часы, которые иногда называют “часы CMOS”. Эти часы не очень точны и время доступа к ним относительно велико. В ядре операционной системы существеют собственные, программные, часы, которые поддерживаются в актуальном состоянии средствами самой операционной системы (возможно с использованием серверов точного времени, см. раздел “Синхронизация времени”). Системные часы обычно точнее аппаратных, поскольку им не требуется доступ к аппаратным ресурсам. Однако эти часы существуют только в памяти машины и обнуляются каждый раз при перезагрузке в отличии от часов CMOS, которые имеют батарейное питание и поэтому продолжают работать во время перезагрузки или после выключения питания. По этой причине системные часы устанавливаются по часам CMOS во время загрузки, которые в свою очередь обновляются системой при завершении работы (для учёта любых возможных изменений, имевших место во время работы).

source: In practice, there is a problem, since the CMOS clock is nothing more than a counter and contains no information regarding the time zone. There is a choice to make regarding its interpretation: either the system considers it runs in universal time (UTC, formerly GMT), or in local time. This choice could be a simple shift, but things are actually more complicated: as a result of daylight saving time, this offset is not constant. The result is that the system has no way to determine whether the offset is correct, especially around periods of time change. Since it is always possible to reconstruct local time from universal time and the timezone information, we strongly recommend using the CMOS clock in universal time.
ru_ru: В практическом плане с аппаратными часами существует проблема, связанная с тем, что эти часы фактически являются счётчиком и не содержат информации о часовом поясе. Интерпретировать данные этого счётчика можно двояко: система либо считает, что она работает по всемирному координированному времени (UTC, ранее известное как GMT), либо по местному времени. Компенсировать разницу между этими вариантами можно было бы простым сдвигом времени, но на самом деле всё несколько сложнее: разница не является постоянной величиной вследствие перевода часов на летнее время. Система не может самостоятельно определить, является ли сдвиг по времени правильным, и это особенно актуально в моменты перевода часов. Поскольку местное время можно легко восстановить при наличии информации о всемирном времени и часовом поясе, то мы настоятельно рекомендуем использовать всемирное время в часах CMOS.

source: Time Synchronization
ru_ru: Синхронизация времени

source: <primary>time synchronization</primary>
ru_ru: <primary>синхронизация времени</primary>

source: <primary>clock</primary><secondary>synchronization</secondary>
ru_ru: <primary>часы</primary><secondary>синхронизация</secondary>

source: Time synchronization, which may seem superfluous on a computer, is very important on a network. Since users do not have permissions allowing them to modify the date and time, it is important for this information to be precise to prevent confusion. Furthermore, having all of the computers on a network synchronized allows better cross-referencing of information from logs on different machines. Thus, in the event of an attack, it is easier to reconstruct the chronological sequence of actions on the various machines involved in the compromise. Data collected on several machines for statistical purposes won't make a great deal of sense if they are not synchronized.
ru_ru: Синхронизация времени может показаться излишней на отдельном компьютере, но она важна для сети. Поскольку пользователи не обладают полномочиями для изменения даты или времени, то эти параметры должны быть корректно настроены для избежания недоразумений. Более того, синхронизация всех компьютеров в сети облегчает организацию перекрёстных ссылок в журналах на различных машинах. Так, например, в случае атаки будет легче восстановить последовательность событий на всех скомпрометированных машинах. Статистические данные, собранные на нескольких машинах, также малоинтересны, если они не синхронизированы.

source: <emphasis>BACK TO BASICS</emphasis> NTP
ru_ru: <emphasis>К ОСНОВАМ</emphasis> NTP

source: <primary>Network</primary><secondary>Time Protocol</secondary>
ru_ru: <primary>Сетевой</primary><secondary>протокол синхронизации времени</secondary>

source: NTP (Network Time Protocol) allows a machine to synchronize with others fairly accurately, taking into consideration the delays induced by the transfer of information over the network and other possible offsets.
ru_ru: NTP (сетевой протокол синхронизации времени) позволяет одному компьютеру достаточно точно синхронизироваться с другими и при этом учесть задержки передачи данных по сети, а также прочие причины временных сдвигов.

source: While there are numerous NTP servers on the Internet, the more popular ones may be overloaded. This is why we recommend using the <emphasis>pool.ntp.org</emphasis> NTP server, which is, in reality, a group of machines that have agreed to serve as public NTP servers. You could even limit use to a sub-group specific to a country, with, for example, <emphasis>us.pool.ntp.org</emphasis> for the United States, or <emphasis>ca.pool.ntp.org</emphasis> for Canada, etc.
ru_ru: Во всемирной сети существует множество NTP серверов, но наиболее популярные из них могут быть перегружены. Поэтому мы рекомендуем использовать <emphasis>pool.ntp.org</emphasis>, который по сути является группой машин, выполняющих функцию публичного NTP сервера. Вы даже можете ограничиться группой серверов, расположенных в одной стране, например, <emphasis>us.pool.ntp.org</emphasis> для США или <emphasis>ca.pool.ntp.org</emphasis> для Канады и т. д.

source: However, if you manage a large network, it is recommended that you install your own NTP server, which will synchronize with the public servers. In this case, all the other machines on your network can use your internal NTP server instead of increasing the load on the public servers. You will also increase homogeneity with your clocks, since all the machines will be synchronized on the same source, and this source is very close in terms of network transfer times.
ru_ru: Если же вы управляете большой сетью, то мы рекомендуем установить собственный NTP сервер и синхронизировать его с вышеуказанными публичными серверами. В этом случае все машины вашей сети будут использовать внутренний сервер, что уменьшит нагрузку на публичные серверы. Такой подход также увеличит однородность показаний часов, поскольку все машины будут синхронизироваться от одного близкорасположенного источника.

source: For Workstations
ru_ru: Для рабочих станций

source: Since work stations are regularly rebooted (even if only to save energy), synchronizing them by NTP at boot is enough. To do so, simply install the <emphasis role="pkg">ntpdate</emphasis> package. You can change the NTP server used if needed by modifying the <filename>/etc/default/ntpdate</filename> file.
ru_ru: Поскольку рабочие станции перезагружаются регулярно (пусть даже с целью экономии электроэнергии), то их достаточно синхронизировать во время загрузки. Для этого необходимо установить пакет <emphasis role="pkg">ntpdate</emphasis>. Используемый NTP сервер можно изменить в файле <filename>/etc/default/ntpdate</filename>.

source: For Servers
ru_ru: Для серверов

source: Servers are only rarely rebooted, and it is very important for their system time to be correct. To permanently maintain correct time, you would install a local NTP server, a service offered in the <emphasis role="pkg">ntp</emphasis> package. In its default configuration, the server will synchronize with <emphasis>pool.ntp.org</emphasis> and provide time in response to requests coming from the local network. You can configure it by editing the <filename>/etc/ntp.conf</filename> file, the most significant alteration being the NTP server to which it refers. If the network has a lot of servers, it may be interesting to have one local time server which synchronizes with the public servers and is used as a time source by the other servers of the network.
ru_ru: Необходимость в перезагрузке сервера возникает редко, а поддерживание корректного системного времени является важным моментом. Для выполнения этой задачи стоит воспользоваться локальным NTP сервером, который можно установить из пакета <emphasis role="pkg">ntp</emphasis>. Настроенный по умолчанию, этот сервер будет синхронизироваться с <emphasis>pool.ntp.org</emphasis> и предоставлять информацию о времени по запросам из локальной сети. Настройки сервера хранятся в файле <filename>/etc/ntp.conf</filename>, а наиболее существенной из них будет адрес NTP сервера для синхронизации. В том случае, когда к сети подключено множество серверов, то имеет смысл создать один сервер времени, который будет синхронизироваться с публичными серверами и использоваться в качестве источника времени для остальных серверов в сети.

source: <primary>server</primary><secondary>NTP</secondary>
ru_ru: <primary>сервер</primary><secondary>NTP</secondary>

source: <primary>NTP</primary><secondary>server</secondary>
ru_ru: <primary>NTP</primary><secondary>сервер</secondary>

source: <emphasis>GOING FURTHER</emphasis> GPS modules and other time sources
ru_ru: <emphasis>УГЛУБЛЯЕМСЯ</emphasis> Модули GPS и прочие источники времени

source: If time synchronization is particularly crucial to your network, it is possible to equip a server with a GPS module (which will use the time from GPS satellites) or a DCF-77 module (which will sync time with the atomic clock near Frankfurt, Germany). In this case, the configuration of the NTP server is a little more complicated, and prior consultation of the documentation is an absolute necessity.
ru_ru: В случае, когда синхронизация времени является критически важной функцией сети, вы можете оснастить сервер модулем GPS (который использует время спутников GPS) или модулем DCF-77 (который синхронизирует время с атомными часами, расположенными вблизи Франкфурта в Германии). Настройка NTP сервера в этих случаях будет несколько сложней, и предварительное ознакомление с документацией обязятельно.

source: Rotating Log Files
ru_ru: Ротация файлов журналов

source: <primary>file</primary><secondary>logs, rotation</secondary>
ru_ru: <primary>файл</primary><secondary>журнала, ротация</secondary>

source: <primary>logs</primary><secondary>files, rotation</secondary>
ru_ru: <primary>журналы</primary><secondary>файлы, ротация</secondary>

source: <primary>rotation of log files</primary>
ru_ru: <primary>ротация файлов журналов</primary>

source: Log files can grow, fast, and it is necessary to archive them. The most common scheme is a rotating archive: the log file is regularly archived, and only the latest <replaceable>X</replaceable> archives are retained. <command>logrotate</command>, the program responsible for these rotations, follows directives given in the <filename>/etc/logrotate.conf</filename> file and all of the files in the <filename>/etc/logrotate.d/</filename> directory. The administrator may modify these files, if they wish to adapt the log rotation policy defined by Debian. The <citerefentry><refentrytitle>logrotate</refentrytitle> <manvolnum>1</manvolnum></citerefentry> man page describes all of the options available in these configuration files. You may want to increase the number of files retained in log rotation, or move the log files to a specific directory dedicated to archiving them rather than delete them. You could also send them by e-mail to archive them elsewhere.
ru_ru: Файлы журналов могут быстро увеличиваться в размерах, поэтому их необходимо архивировать. Наиболее распространённой схемой является ротация архивов: файлы журналов регулярно архивируются и только последние <replaceable>X</replaceable> архивов сохраняются. <command>logrotate</command>, программа, выполняющая ротацию, действует в соответствии с настройками в файле <filename>/etc/logrotate.conf</filename> и в файлах каталога <filename>/etc/logrotate.d/</filename>. Администратор может изменить эти файлы для адаптации ротации журналов к политике Debian. На странице руководства <citerefentry><refentrytitle>logrotate</refentrytitle> <manvolnum>1</manvolnum></citerefentry> описаны все возможные настройки данных файлов. Возможно, что вам потребуется увеличить количество сохраняемых при ротации файлов или перенести файлы журналов в отдельный каталог, предназначенный для архивации. Вы даже можете отправлять их почтой для архивации в другом месте.

source: The <command>logrotate</command> program is executed daily by the <command>cron</command> scheduling program (described in <xref linkend="sect.task-scheduling-cron-atd" />).
ru_ru: Команда <command>logrotate</command> выполняется ежедневно планировщиком <command>cron</command> (рассматривается в <xref linkend="sect.task-scheduling-cron-atd" />).

source: Sharing Administrator Rights
ru_ru: Разделение административных задач

source: <primary>account</primary><secondary>administrator account</secondary>
ru_ru: <primary>учётная запись</primary><secondary>учётная запись администратора</secondary>

source: <primary>root</primary>
ru_ru: <primary>суперпользователь</primary>

source: Frequently, several administrators work on the same network. Sharing the root passwords is not very elegant, and opens the door for abuse due to the anonymity such sharing creates. The solution to this problem is the <command>sudo</command> program, which allows certain users to execute certain commands with special rights. In the most common use case, <command>sudo</command> allows a trusted user to execute any command as root. To do so, the user simply executes <command>sudo <replaceable>command</replaceable></command> and authenticates using their personal password.
ru_ru: Часто бывает так, что несколько администраторов работают в одной сети. Назначение всем паролей суперпользователя является не самым элегантным решением, поскольку такой подход увеличивает потенциальную возможность злоупотребления. Решением в таких случаях является программа <command>sudo</command>, которая позволяет определённым пользователям выполнять определённые команды в соответствии с установленными правилами. В общем случае <command>sudo</command> позволяет доверенному пользователю выполнять команды в качестве суперпользователя. Для этого пользователю необходимо всего лишь набрать <command>sudo <replaceable>command</replaceable></command> и ввести свой пароль.

source: More sophisticated configurations allow authorization of only specific commands to specific users. All the details of the various possibilities are given in the <citerefentry><refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man page.
ru_ru: Более сложные варианты настройки позволяют организовать доступ к определённым командам для определённых пользователей. Все детали настройки приведены на странице руководства <citerefentry><refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.

source: List of Mount Points
ru_ru: Список точек монтирования
