Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: A Debian kernel package installs the kernel image (<filename>vmlinuz-<replaceable>version</replaceable></filename>), its configuration (<filename>config-<replaceable>version</replaceable></filename>) and its symbols table (<filename>System.map-<replaceable>version</replaceable></filename>) in <filename>/boot/</filename>. The symbols table helps developers understand the meaning of a kernel error message; without it, kernel “oopses” (an “oops” is the kernel equivalent of a segmentation fault for user space programs, in other words messages generated following an invalid pointer dereference) only contain numeric memory addresses, which is useless information without the table mapping these addresses to symbols and function names. The modules are installed in the <filename>/lib/modules/<replaceable>version</replaceable>/</filename> directory.
ru_ru: Пакет с ядром Debian устанавливает образ ядра (<filename>vmlinuz-<replaceable>version</replaceable></filename>), его конфигурационный файл (<filename>config-<replaceable>version</replaceable></filename>) и статическую таблицу имён (<filename>System.map-<replaceable>version</replaceable></filename>) в <filename>/boot/</filename>. Таблица имён помогает разработчикам разбираться в сообщениях об ошибках ядра; без этой таблицы сообщения ядра “oops” (“oops” - это ядерный аналог ошибки сегментации программы из пространства пользователя; другими словами, такая ошибка возникает при неверном разыменовании указателя) содержат только цифровые значения адресов памяти, которые бесполезны без таблицы отображения этих адресов в символы и имена функций. Модули устанавливаются в каталог <filename>/lib/modules/<replaceable>version</replaceable>/</filename>.

source: The package's configuration scripts automatically generate an initrd image, which is a mini-system designed to be loaded in memory (hence the name, which stands for “init ramdisk”) by the bootloader, and used by the Linux kernel solely for loading the modules needed to access the devices containing the complete Debian system (for example, the driver for IDE disks). Finally, the post-installation scripts update the symbolic links <filename>/vmlinuz</filename>, <filename>/vmlinuz.old</filename>, <filename>/initrd.img</filename> and <filename>/initrd.img.old</filename> so that they point to the latest two kernels installed, respectively, as well as the corresponding initrd images.
ru_ru: Конфигурационные скрипты пакета автоматически формируют образ initrd, который является системой в миниатюре и загружается в память загрузчиком (отсюда и название, которое означает “init ramdisk”). Этот образ используется исключительно ядром Linux для загрузки модулей, необходимых для доступа к устройствам, которые содержат полную систему Debian (например, драйвер дисков IDE). Наконец, пост-инсталляционные скрипты обновляют символические ссылки <filename>/vmlinuz</filename>, <filename>/vmlinuz.old</filename>, <filename>/initrd.img</filename> и <filename>/initrd.img.old</filename> таким образом, чтобы они соответственно указывали на два последних установленных ядра, а также на соответствующие образы initrd.

source: Installing with <command>dpkg</command>
ru_ru: Установка через <command>dpkg</command>

source: The configuration steps described in this chapter are basic and can lead both to a server system or a workstation, and it can be massively duplicated in semi-automated ways. However, it is not enough by itself to provide a fully configured system. A few pieces are still in need of configuration, starting with low-level programs known as the “Unix services”.
ru_ru: В этой главе описаны основные мероприятия по настройке, которые применимы как к рабочей станции, так и к серверу. Все эти мероприятия можно тиражировать в полуавтоматическом режиме. Однако этих мер недостаточно для построения полностью настроенной системы. Некоторые части системы требуют отдельной настройки, и большая часть из них является низкоуровневыми программами, известными как “службы Unix”.
