Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: Each hardware peripheral device is represented under Unix with a special file, usually stored in the file tree under <filename>/dev/</filename> (DEVices). Two types of special files exist according to the nature of the device: “character mode” and “block mode” files, each mode allowing for only a limited number of operations. While character mode limits interaction with read/write operations, block mode also allows seeking within the available data. Finally, each special file is associated with two numbers (“major” and “minor”) that identify the device to the kernel in a unique manner. Such a file, created by the <command>mknod</command> command, simply contains a symbolic (and more human-friendly) name.
ru_ru: В Unix каждое периферийное устройство представлено специальным файлом, который обычно находится в структуре <filename>/dev/</filename> (DEVices, устройства). Существуют два типа специальных файлов в соответствии с природой самих устройств: файлы с символьным режимом доступа и файлы с блочным режимом доступа, каждый из которых имеет ограниченный набор операций. Символьный режим ограничивает взаимодействие операциями чтения/записи, в то время как блочный режим допускает ещё и поиск в массиве данных. Наконец, каждому специальному файлу присваиваются два номера (“основной” и “второстепенный”), которые однозначно идентифицируют файлы в ядре. Созданный командой <command>mknod</command> подобный файл имеет буквенное (и более понятное пользователю) имя.

source: The permissions of a special file map to the permissions necessary to access the device itself. Thus, a file such as <filename>/dev/mixer</filename>, representing the audio mixer, only has read/write permissions for the root user and members of the <literal>audio</literal> group. Only these users can operate the audio mixer.
ru_ru: Права доступа к файлу устройства отображаются на права доступа к самому устройству. Таким образом, право на чтение/запись в файл <filename>/dev/mixer</filename>, представляющий звуковой микшер, имеют только администратор и члены группы <literal>audio</literal>. Только эти пользователи могут управлять звуковым микшером.

source: It should be noted that the combination of <emphasis role="pkg">udev</emphasis>, <emphasis role="pkg">consolekit</emphasis> and <emphasis role="pkg">policykit</emphasis> can add additional permissions to allow users physically connected to the console (and not through the network) to access to certain devices.
ru_ru: Стоит отметить, что с помощью <emphasis role="pkg">udev</emphasis>, <emphasis role="pkg">consolekit</emphasis> и <emphasis role="pkg">policykit</emphasis> можно организовать дополнительные права доступа к определённым устройствам для пользователей, физически (не через сеть) подключенных к терминалу.

source: Shell Environment
ru_ru: Окружение оболочки

source: Command interpreters (or shells) are frequently a user's first point of contact with the computer, and they must therefore be rather friendly. Most of them use initialization scripts that allow configuration of their behavior (automatic completion, prompt text, etc.).
ru_ru: Командный интерпретатор (или оболочка) зачатую является первым способом взаимодействия пользователя с компьютером, и по этой причине он должен быть дружественным. Настройка поведения (автоматическое дополнение, текст строки приглашения и т. д.) большинства оболочек осуществляется посредством скриптов.

source: <primary>command line interface</primary>
ru_ru: <primary>интерфейс командной строки</primary>

source: <primary>shell</primary>
ru_ru: <primary>оболочка</primary>

source: <command>bash</command>, the standard shell, uses the <filename>/etc/bash.bashrc</filename> initialization script for “interactive” shells, and <filename>/etc/profile</filename> for “login” shells.
ru_ru: <command>bash</command>, стандартная оболочка, использует инициализационный скрипт <filename>/etc/bash.bashrc</filename> для интерактивных оболочек и <filename>/etc/profile</filename> для интерактивных оболочек с регистрацией.

source: <emphasis>BACK TO BASICS</emphasis> Login shell and (non) interactive shell
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Оболочка с регистрацией и (не)интерактивная оболочка

source: <emphasis>DISCOVERY</emphasis> Other shells, other scripts
ru_ru: <emphasis>ОТКРЫТИЕ</emphasis> Другие оболочки, другие скрипты

source: Each command interpreter has a specific syntax and its own configuration files. Thus, <command>zsh</command> uses <filename>/etc/zshrc</filename> and <filename>/etc/zshenv</filename>; <command>csh</command> uses <filename>/etc/csh.cshrc</filename>, <filename>/etc/csh.login</filename> and <filename>/etc/csh.logout</filename>. The man pages for these programs document which files they use.
ru_ru: В каждом командном интерпретаторе используется собственный синтаксис и конфигурационные файлы. Например, <command>zsh</command> использует <filename>/etc/zshrc</filename> и <filename>/etc/zshenv</filename>; <command>csh</command> использует <filename>/etc/csh.cshrc</filename>, <filename>/etc/csh.login</filename> и <filename>/etc/csh.logout</filename>. Используемые конфигурационные файлы указаны на страницах руководств этих программ.

source: For <command>bash</command>, it is useful to activate “automatic completion” in the <filename>/etc/bash.bashrc</filename> file (simply uncomment a few lines).
ru_ru: Автоматическое дополнение <command>bash</command> является полезной функцией, которую стоит активировать в файле <filename>/etc/bash.bashrc</filename> (просто удалите знак комментария в нескольких строках).

source: <emphasis>BACK TO BASICS</emphasis> Automatic completion
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Автоматическое дополнение

source: <primary>automatic completion</primary>
ru_ru: <primary>автоматическое дополнение</primary>

source: Many command interpreters provide a completion feature, which allows the shell to automatically complete a partially typed command name or argument when the user hits the <keycap>Tab</keycap> key. This lets users work more efficiently and be less error-prone.
ru_ru: Многие командные интерпретаторы имеют функцию дополнения, которая позволяет оболочке автоматически завершить частично набранную команду или аргумент по нажатию клавиши <keycap>Tab</keycap>. Эта функция позволяет пользователям работать более эффективно и совершать меньше ошибок.

source: This function is very powerful and flexible. It is possible to configure its behavior according to each command. Thus, the first argument following <command>apt-get</command> will be proposed according to the syntax of this command, even if it does not match any file (in this case, the possible choices are <literal>install</literal>, <literal>remove</literal>, <literal>upgrade</literal>, etc.).
ru_ru: Автодополнение - это мощный и гибкий инструмент, поведение которого можно настроить для каждой команды. Так, первый предложенный аргумент после <command>apt-get</command> будет соответствовать синтаксису этой команды (в данном случае это могут быть <literal>install</literal>, <literal>remove</literal>, <literal>upgrade</literal>, и т. д.).

source: <emphasis>BACK TO BASICS</emphasis> The tilde, a shortcut to HOME
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Тильда - ярлык для домашнего каталога

source: <primary>tilde</primary>
ru_ru: <primary>тильда</primary>

source: The tilde is often used to indicate the directory to which the environment variable, <varname>HOME</varname>, points (being the user's home directory, such as <filename>/home/rhertzog/</filename>). Command interpreters automatically make the substitution: <filename>~/hello.txt</filename> becomes <filename>/home/rhertzog/hello.txt</filename>.
ru_ru: Тильда часто используется для указания каталога, которому соответствует переменная окружения <varname>HOME</varname> (который является домашним каталогом пользователя, например, <filename>/home/rhertzog/</filename>). Командные интерпретаторы выполняют замену автоматически: <filename>~/hello.txt</filename> становится <filename>/home/rhertzog/hello.txt</filename>.

source: The tilde also allows access to another user's home directory. Thus, <filename>~rmas/bonjour.txt</filename> is synonymous with <filename>/home/rmas/bonjour.txt</filename>.
ru_ru: Тильда также обеспечивает доступ к домашнему каталогу другого пользователя. Так, путь <filename>~rmas/bonjour.txt</filename> идентичен <filename>/home/rmas/bonjour.txt</filename>.

source: In addition to these common scripts, each user can create their own <filename>~/.bashrc</filename> and <filename>~/.bash_profile</filename> to configure their shell. The most common changes are the addition of aliases; these are words that are automatically replaced with the execution of a command, which makes it faster to invoke that command. For instance, you could create the <literal>la</literal> alias for the command <command>ls -la | less</command> command; then you only have to type <command>la</command> to inspect the contents of a directory in detail.
ru_ru: В дополнение к этим общим скриптам пользователь может создать свои собственные <filename>~/.bashrc</filename> и <filename>~/.bash_profile</filename> для настройки своей оболочки. Обычно в эти файлы добавляют псевдонимы - короткие команды, которые автоматически заменяются на полные при вызове, что позволяет быстрее выполнять соответствующее действие. Например, вы можете создать псевдоним <literal>la</literal> для вызова <command>ls -la | less</command> и набирать <command>la</command> для вывода подробного содержимого каталога.

source: <emphasis>BACK TO BASICS</emphasis> Environment variables
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Переменные окружения

source: Environment variables allow storage of global settings for the shell or various other programs called. They are contextual (each process has its own set of environment variables) but inheritable. This last characteristic offers the possibility for a login shell to declare variables which will be passed down to all programs it executes.
ru_ru: Переменные окружения позволяют хранить глобальные настройки для оболочки или других программ. Они зависят от контекста (каждый процесс имеет свой собственный набор переменных окружения), но являются наследуемыми. Последняя характеристика подразумевает возможность объявления переменных в оболочке с регистрацией, которые затем будут переданы всем дочерним процессам.

source: Setting default environment variables is an important element of shell configuration. Leaving aside the variables specific to a shell, it is preferable to place them in the <filename>/etc/environment</filename> file, since it is used by the various programs likely to initiate a shell session. Variables typically defined there include <varname>ORGANIZATION</varname>, which usually contains the name of the company or organization, and <varname>HTTP_PROXY</varname>, which indicates the existence and location of an HTTP proxy.
ru_ru: Объявление переменных окружения по умолчанию является важным элементом настройки оболочки. Специфические для оболочки настройки желательно поместить в файл <filename>/etc/environment</filename>, поскольку он может использоваться различными программами для запуска сессии. Чаще всего в этом файле определены переменные <varname>ORGANIZATION</varname>, которая обычно содержит название компании или организации, и <varname>HTTP_PROXY</varname>, которая указывает на наличие HTTP-прокси и его размещение.

source: <emphasis>TIP</emphasis> All shells configured identically
ru_ru: <emphasis>СОВЕТ</emphasis> Идентичная настройка всех оболочек

source: Users often want to configure their login and interactive shells in the same way. To do this, they choose to interpret (or “source”) the content from <filename>~/.bashrc</filename> in the <filename>~/.bash_profile</filename> file. It is possible to do the same with files common to all users (by calling <filename>/etc/bash.bashrc</filename> from <filename>/etc/profile</filename>).
ru_ru: Пользователи часто хотят одинаково настроить свою интерактивную оболочку и оболочку с регистрацией. Для этого они вызывают скрипт <filename>~/.bashrc</filename> из файла <filename>~/.bash_profile</filename>. Точно так же можно поступить и с общими для всех пользователей файлами (путём вызова <filename>/etc/bash.bashrc</filename> из <filename>/etc/profile</filename>).

source: Printer Configuration
ru_ru: Настройка принтера

source: <primary>configuration</primary><secondary>printing</secondary>
ru_ru: <primary>настройка</primary><secondary>печати</secondary>

source: <primary>printing</primary><secondary>configuration</secondary>
ru_ru: <primary>печати</primary><secondary>настройки</secondary>

source: <primary>Internet Printing Protocol</primary>
ru_ru: <primary>протокол межсетевой печати</primary>

source: This program is divided over several Debian packages: <emphasis role="pkg">cups</emphasis> is the central print server; <emphasis role="pkg">cups-bsd</emphasis> is a compatibility layer allowing use of commands from the traditional BSD printing system (<command>lpd</command> daemon, <command>lpr</command> and <command>lpq</command> commands, etc.); <emphasis role="pkg">cups-client</emphasis> contains a group of programs to interact with the server (block or unblock a printer, view or delete print jobs in progress, etc.); and finally, <emphasis role="pkg">cups-driver-gutenprint</emphasis> contains a collection of additional printer drivers for <command>cups</command>.
ru_ru: Эта программа разделена на несколько пакетов Debian: <emphasis role="pkg">cups</emphasis> - основной сервер печати; <emphasis role="pkg">cups-bsd</emphasis> - слой совместимости, позволяющий использовать команды традиционной системы печати BSD (демон <command>lpd</command>, команды <command>lpr</command> и <command>lpq</command>, и т. д.); <emphasis role="pkg">cups-client</emphasis> содержит набор программ для взаимодействия с сервером (блокировка или разблокировка принтера, отображение или удаление текущих задач в очереди печати и т. д.); и, наконец, <emphasis role="pkg">cups-driver-gutenprint</emphasis> включает в себя дополнительный драйверы принтеров для <command>cups</command>.

source: <primary><command>lpd</command></primary>
ru_ru: <primary><command>lpr</command></primary>

source: <primary><command>lpq</command></primary>
ru_ru: <primary><command>lpr</command></primary>

source: <emphasis>COMMUNITY</emphasis> CUPS
ru_ru: <emphasis>СООБЩЕСТВО</emphasis> CUPS

source: <primary>Common Unix Printing System</primary>
ru_ru: <primary>Сервер печати для Unix-подобных операционных систем</primary>

source: <primary><command>cups</command></primary><secondary>administration</secondary>
ru_ru: <primary><command>cups</command></primary><secondary>управление</secondary>

source: <emphasis>NOTE</emphasis> Obsolescence of <filename>/etc/printcap</filename>
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Устаревший <filename>/etc/printcap</filename>

source: <emphasis>cups</emphasis> no longer uses the <filename>/etc/printcap</filename> file, which is now obsolete. Programs that rely upon this file to get a list of available printers will, thus, fail. To avoid this problem, delete this file and make it a symbolic link (see sidebar <xref linkend="sidebar.symbolic-link" />) to <filename>/var/run/cups/printcap</filename>, which is maintained by <emphasis>cups</emphasis> to ensure compatibility.
ru_ru: <emphasis>cups</emphasis> больше не использует файл <filename>/etc/printcap</filename>, он теперь считается устаревшим. Программы, которые получали список доступных принтеров из этого файла, больше не смогут этого сделать. Удалите этот файл во избежание подобной проблемы и создайте вместо него символическую ссылку (см. врезку <xref linkend="sidebar.symbolic-link" />) на <filename>/var/run/cups/printcap</filename>, который поддерживается <emphasis>cups</emphasis> для обратной совместимости.

source: Configuring the Bootloader
ru_ru: Настройка загрузчика

source: <primary>loader</primary><secondary>bootloader</secondary>
ru_ru: <primary>загрузчик</primary><secondary>загрузчик операционной сисетмы</secondary>

source: <primary>bootloader</primary>
ru_ru: <primary>загрузчик</primary>

source: It is probably already functional, but it is always good to know how to configure and install the bootloader in case it disappears from the Master Boot Record. This can occur after installation of another operating system, such as Windows. The following information can also help you to modify the bootloader configuration if needed.
ru_ru: Обычно загрузчик полностью работоспособен, но знания о его установке и настройке будут полезны в том случае, если он вдруг исчезнет из основной загрузочной записи. Это может случиться после установки другой операционной системы, Windows, например. Нижеприведённая информация также пригодится вам для изменения настроек загрузчика.

source: <emphasis>BACK TO BASICS</emphasis> Master boot record
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Основная загрузочная запись

source: <primary>Master Boot Record</primary>
ru_ru: <primary>основная загрузочная запись</primary>

source: Identifying the Disks
ru_ru: Определение дисков

source: <primary>hard drive, names</primary>
ru_ru: <primary>жёсткий диск, имена</primary>

source: <primary>names</primary><secondary>of hard drives</secondary>
ru_ru: <primary>имена</primary><secondary>жёстких дисков</secondary>

source: Each partition is represented by its number on the disk on which it resides: for instance, <filename>/dev/sda1</filename> is the first partition on the first disk, and <filename>/dev/sdb3</filename> is the third partition on the second disk.
ru_ru: Каждый раздел имеет свой собственный номер на том диске, на котором он расположен. Например, <filename>/dev/sda1</filename> относится к первому разделу на первом диске, а <filename>/dev/sdb3</filename> - это третий раздел на втором диске.

source: The PC architecture (or “i386”) is limited to four “primary” partitions per disk. To go beyond this limitation, one of them must be created as an “extended” partition, and it can then contain additional “secondary” partitions. These secondary partitions must be numbered from 5. Thus the first secondary partition could be <filename>/dev/sda5</filename>, followed by <filename>/dev/sda6</filename>, etc.
ru_ru: Архитектура ПК (или i386) ограничена четырьмя основными разделами на каждый диск. Для преодоления этого ограничения один из разделов создаётся как расширенный раздел, который может содержать дополнительные разделы. Нумерация дополнительных разделов начинается с 5. Поэтому первым вторичным разделом может быть <filename>/dev/sda5</filename>, следующим будет <filename>/dev/sda6</filename> и так далее.

source: <primary>partition</primary><secondary>primary</secondary>
ru_ru: <primary>раздел</primary><secondary>основной</secondary>

source: <primary>partition</primary><secondary>extended</secondary>
ru_ru: <primary>раздел</primary><secondary>расширенный</secondary>

source: <primary>partition</primary><secondary>secondary</secondary>
ru_ru: <primary>раздел</primary><secondary>вторичный</secondary>

source: It is not always easy to remember what disk is connected to which SATA controller, or in third position in the SCSI chain, especially since the naming of hotplugged hard drives (which includes among others most SATA disks and external disks) can change from one boot to another. Fortunately, <command>udev</command> creates, in addition to <filename>/dev/sd*</filename>, symbolic links with a fixed name, which you could then use if you wished to identify a hard drive in a non-ambiguous manner. These symbolic links are stored in <filename>/dev/disk/by-id</filename>. On a machine with two physical disks, for example, one could find the following:
ru_ru: Иногда бывает сложно запомнить схему подключения дисков к SATA-контроллерам или положение определённого диска в цепочке SCSI с учётом того факта, что имена дисков с возможностью горячей замены (которые, среди прочих, включают в себя большинство SATA-дисков и внешних дисков) могут измениться после перезагрузки. К счастью, <command>udev</command> создаёт символические ссылки с неизменными именами в дополнение к файлам <filename>/dev/sd*</filename>, и вы можете использовать эти ссылки для однозначной идентификации жёстких дисков. Данные символические ссылки находятся в каталоге <filename>/dev/disk/by-id</filename>. К примеру, на машине с двумя физическими дисками можно обнаружить следующее:

source: Note that some disks are listed several times (because they behave simultaneously as ATA disks and SCSI disks), but the relevant information is mainly in the model and serial numbers of the disks, from which you can find the peripheral file.
ru_ru: Обратите внимание, что некоторые диски занимают несколько позиций в списке (поскольку они представляются одновременно как ATA и SCSI-диски), но полезная информация содержится только в названии модели и серийном номере, из которых вы можете определить имя файла устройства.

source: Configuring LILO
ru_ru: Настройка LILO

source: <primary>Linux Loader</primary>
ru_ru: <primary>Загрузчик Linux</primary>

source: <emphasis>LILO</emphasis> (LInux LOader) is the oldest bootloader — solid but rustic. It writes the physical address of the kernel to boot on the MBR, which is why each update to LILO (or its configuration file) must be followed by the command <command>lilo</command>. Forgetting to do so will render a system unable to boot if the old kernel was removed or replaced as the new one will not be in the same location on the disk.
ru_ru: <emphasis>LILO</emphasis> (LInux LOader, загрузчик Linux) - это самый старый загрузчик, надёжный, но очень простой. Он записывает физический адрес загружаемого ядра в MBR, и поэтому команду <command>lilo</command> необходимо выполнять после каждого обновления LILO (или его конфигурационных файлов). Если вы этого не сделаете и старое ядро окажется удалённым или перемещённым, то система не сможет загрузиться, поскольку новое ядро будет расположено на диске по другому адресу.

source: LILO's configuration file is <filename>/etc/lilo.conf</filename>; a simple file for standard configuration is illustrated in the example below.
ru_ru: Настройки LILO находятся в файле <filename>/etc/lilo.conf</filename>. Простой файл со стандартными настройками приведён ниже.

source: LILO configuration file
ru_ru: Конфигурационный файл LILO

source: GRUB 2 Configuration
ru_ru: Настройка GRUB 2

source: <emphasis>GRUB</emphasis> (GRand Unified Bootloader) is more recent. It is not necessary to invoke it after each update of the kernel; <emphasis>GRUB</emphasis> knows how to read the filesystems and find the position of the kernel on the disk by itself. To install it on the MBR of the first disk, simply type <command>grub-install /dev/sda</command>. <indexterm><primary><command>grub-install</command></primary></indexterm>
ru_ru: <emphasis>GRUB</emphasis> (GRand Unified Bootloader) несколько новее. Его не нужно вызывать после каждого обновления ядра, так так <emphasis>GRUB</emphasis> умеет читать файловые системы и находить расположение ядра на диске. Для установки этого загрузчика в MBR первого диска достаточно набрать <command>grub-install /dev/sda</command>. <indexterm><primary><command>grub-install</command></primary></indexterm>

source: <emphasis>NOTE</emphasis> Disk names for GRUB
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Имена дисков для GRUB
