Repository: mikhirev/debian-handbook-ru
Catalog: */08_basic-configuration.po
Languages: ru_ru

source: <primary>connection</primary><secondary>on demand</secondary>
ru_ru: <primary>соединение</primary><secondary>по запросу</secondary>

source: <command>diald</command> is an on-demand connection service that automatically establishes a connection when needed, by detecting an outgoing IP packet and disconnecting after a period of inactivity.
ru_ru: <command>diald</command> - это служба соединения по запросу, которая автоматически устанавливает соединение при необходимости путём определения исходящих IP пакетов и разрывает соединение после определённого периода бездействия.

source: Connecting through an ADSL Modem
ru_ru: Подключение через ADSL модем

source: <primary>connection</primary><secondary>by ADSL modem</secondary>
ru_ru: <primary>подключение</primary><secondary>через ADSL модем</secondary>

source: <primary>modem</primary><secondary>ADSL</secondary>
ru_ru: <primary>модем</primary><secondary>ADSL</secondary>

source: <primary>ADSL, modem</primary>
ru_ru: <primary>ADSL, модем</primary>

source: Modems Supporting PPPOE
ru_ru: Модемы с поддержкой PPPOE

source: Some Ethernet modems work with the PPPOE protocol (Point to Point Protocol over Ethernet). The <command>pppoeconf</command> tool (from the package with the same name) will configure the connection. To do so, it modifies the <filename>/etc/ppp/peers/dsl-provider</filename> file with the settings provided and records the login information in the <filename>/etc/ppp/pap-secrets</filename> and <filename>/etc/ppp/chap-secrets</filename> files. It is recommended to accept all modifications that it proposes.
ru_ru: Некоторые Ethernet модемы используют протокол PPPOE (протокол “точка-точка” через Ethernet). Утилита <command>pppoeconf</command> (из одноимённого пакета) позволит вам настроить соединение. Она изменяет файл <filename>/etc/ppp/peers/dsl-provider</filename> в соответствии с предоставленными настройками и записывает параметры аутентификации в файлы <filename>/etc/ppp/pap-secrets</filename> и <filename>/etc/ppp/chap-secrets</filename>. Рекомендуется принять те значения, которые утилита вам предоставит.

source: Once this configuration is complete, you can open the ADSL connection with the command, <command>pon dsl-provider</command> and disconnect with <command>poff dsl-provider</command>.
ru_ru: Вы можете установить ADSL соединение командой <command>pon dsl-provider</command> сразу после окончания настройки и разорвать его командой <command>poff dsl-provider</command>.

source: <emphasis>TIP</emphasis> Starting <command>ppp</command> via <command>init</command>
ru_ru: <emphasis>СОВЕТ</emphasis> Запуск <command>ppp</command> через <command>init</command>

source: PPP connections over ADSL are, by definition, intermittent. Since they are usually not billed according to time, there are few downsides to the temptation of keeping them always open; one simple means to do so is to use the <command>init</command> process to control the connection. All that's needed is to add a line such as the following at the end of the <filename>/etc/inittab</filename> file; then, any time the connection is disconnected, <command>init</command> will reconnect it.
ru_ru: PPP соединения через ADSL модем являются непостоянными по своей сути. Поскольку они обычно тарифицируются не по времени, то сложно удержаться от соблазна держать их постоянно открытыми. Одним из способов достижения этой цели является использование процесса <command>init</command> для контроля соединения. Требуется лишь добавить следующую строку в конце файла <filename>/etc/inittab</filename> и каждый раз при обрыве соединения <command>init</command> вновь восстановит его.

source: Most ADSL connections disconnect on a daily basis, but this method reduces the duration of the interruption.
ru_ru: В большинстве случаев ADSL соединения разрываются ежедневно, а вышеуказанный метод позволяет сократить время разрыва.

source: Modems Supporting PPTP
ru_ru: Модемы с поддержкой PPTP

source: The PPTP (Point-to-Point Tunneling Protocol) protocol was created by Microsoft. Deployed at the beginning of ADSL, it was quickly replaced by PPPOE. If this protocol is forced on you, see <xref linkend="network-infrastructure" /> in the section about virtual private networks detailing PPTP.
ru_ru: Протокол PPTP (протокол туннелирования “точка-точка”) разработан компанией Microsoft. Применявшийся на заре ADSL, он был быстро вытеснен протоколом PPPOE. Если вы вынуждены использовать этот протокол, то смотрите раздел о виртуальных частных сетях касательно PPTP по ссылке <xref linkend="network-infrastructure" />.

source: Modems Supporting DHCP
ru_ru: Модемы с поддержкой DHCP

source: When a modem is connected to the computer by an Ethernet cable (crossover cable) you typically configure a network connection by DHCP on the computer; the modem automatically acts as a gateway by default and takes care of routing (meaning that it manages the network traffic between the computer and the Internet).
ru_ru: Если модем подключен к компьютеру Ethernet кабелем (перекрёстным кабелем), то обычно вы настраиваете сетевое соединение на компьютере через DHCP; модем автоматически выступает в роли шлюза и выполняет маршрутизацию (т. е. управляет сетевым трафиком между компьютером и сетью Интернет).

source: <emphasis>BACK TO BASICS</emphasis> Crossover cable for a direct Ethernet connection
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Перекрёстный кабель для прямых Ethernet соединений

source: <primary>crossover cable</primary>
ru_ru: <primary>перекрёстный кабель</primary>

source: Computer network cards expect to receive data on specific wires in the cable, and send their data on others. When you connect a computer to a local network, you usually connect a cable (straight or crossover) between the network card and a repeater or switch. However, if you want to connect two computers directly (without an intermediary switch or repeater), you must route the signal sent by one card to the receiving side of the other card, and vice-versa. This is the purpose of a crossover cable, and the reason it is used.
ru_ru: Сетевая карта компьютера принимает данные только по определённым проводам кабеля и отправляет их по другим. Когда вы подключаете компьютер к локальной сети, то обычно вы соединяете кабелем (прямым или перекрёстным) сетевую карту и повторитель или коммутатор. Однако если вам необходимо соединить два компьютера напрямую (без промежуточного повторителя или коммутатора), то вам следует позаботиться о том, чтоб сигнал, отправленный одной картой, был направлен на приёмник другой карты и наоборот. Перекрёстные кабели используются именно по этой причине.

source: Automatic Network Configuration for Roaming Users
ru_ru: Автоматическая настройка сети для перемещающихся пользователей

source: <primary>network</primary><secondary>roaming configuration</secondary>
ru_ru: <primary>сетевой</primary><secondary>настройка роуминга</secondary>

source: Many Falcot engineers have a laptop computer that, for professional purposes, they also use at home. The network configuration to use differs according to location. At home, it may be a wifi network (protected by a WEP key), while the workplace uses a wired network for greater security and more bandwidth.
ru_ru: Многие инженеры Falcot владеют ноутбуками и пользуются ими дома в профессиональных целях. Используемая в данный момент конфигурация сети зависит от местоположения. Это может быть Wi-Fi сеть в доме (защищённая WEP-ключом), в то время как на рабочем месте используется более защищённое проводное соединение с большей пропускной способностью.

source: To avoid having to manually connect or disconnect the corresponding network interfaces, administrators installed the <emphasis role="pkg">network-manager</emphasis> package on these roaming machines. This software enables a user to easily switch from one network to another using a small icon displayed in the notification area of their graphical desktop. Clicking on this icon displays a list of available networks (both wired and wireless), so they can simply choose the network they wish to use. The program saves the configuration for the networks to which the user has already connected, and automatically switches to the best available network when the current connection drops.
ru_ru: Администраторы установили пакет <emphasis role="pkg">network-manager</emphasis> на свои роуминговые машины для того, чтоб избежать ручного управления соответствующими сетевыми интерфейсами. Данное программное обеспечение позволяет пользователю переключаться из одной сети в другую, используя маленькую иконку в области уведомлений графической среды. По щелчку мышью по этой иконке отображается список доступных сетей (как проводных, так и беспроводных), и пользователи могут просто выбрать используемую сеть. Программа сохраняет конфигурацию тех сетей, к которым пользователь подключался и автоматически переключается на доступную сеть в случае обрыва текущего соединения.

source: Note that this program is installed by default when the “Desktop Environment” task is chosen during initial installation.
ru_ru: Стоит отметить, что эта программа устанавливается автоматически при выборе задачи “Окружение рабочего стола” во время установки системы.

source: <emphasis>ALTERNATIVE</emphasis> Configuration by “network profile”
ru_ru: <emphasis>АЛЬТЕРНАТИВА</emphasis> Настройка с помощью сетевых профилей

source: More advanced users may want to try the <emphasis role="pkg">guessnet</emphasis> package for automatic network configuration. A group of test scripts determine which network profile should be activated and configure it on the fly.
ru_ru: Более продвинутые пользователи возможно предпочтут пакет <emphasis role="pkg">guessnet</emphasis> для автоматической настройки сети. Группа тестовых скриптов из этого пакета определяет подходящий сетевой профиль и настраивает его на лету.

source: Users who prefer to manually select a network profile will prefer the <emphasis role="pkg">netenv</emphasis> program, found in the package of the same name.
ru_ru: Пользователи, предпочитающие выбирать сетевые профили вручную, предпочтут программу <emphasis role="pkg">netenv</emphasis> из одноимённого пакета.

source: Setting the Hostname and Configuring the Name Service
ru_ru: Установка имени компьютера и настройка службы имён

source: <primary>name</primary><secondary>attribution and resolution</secondary>
ru_ru: <primary>имя</primary><secondary>присвоение и разрешение</secondary>

source: <primary>assignment of names</primary>
ru_ru: <primary>назначение имён</primary>

source: The purpose of assigning names to IP numbers is to make them easier for people to remember. In reality, an IP address identifies a network interface associated with a device such as a network card. Since each machine can have several network cards, and several interfaces on each card, one single computer can have several names in the domain name system.
ru_ru: Цель привязки имён к цифровым IP адресам - упростить запоминание. В реальности IP адрес указывает на сетевой интерфейс какого-либо устройства, например, сетевой карты. Так как любой компьютер может иметь несколько сетевых карт с несколькими сетевыми интерфейсами на каждой карте, то ему может быть назначено несколько имён в системе доменных имён.

source: Each machine is, however, identified by a main (or “canonical”) name, stored in the <filename>/etc/hostname</filename> file and communicated to the Linux kernel by initialization scripts through the <command>hostname</command> command. The current value is available in a virtual filesystem, and you can get it with the <command>cat /proc/sys/kernel/hostname</command> command.
ru_ru: Несмотря на это каждая машина идентифицируется основным (или “каноническим”) именем, которое хранится в файле <filename>/etc/hostname</filename> и которое используется инициализационными скриптами для связи с ядром Linux посредством команды <command>hostname</command>. Текущее значение имени можно получить через виртуальную файловую систему командой <command>cat /proc/sys/kernel/hostname</command>.

source: <emphasis>BACK TO BASICS</emphasis> <filename>/proc/</filename> and <filename>/sys/</filename>, virtual filesystems
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Виртуальные файловые системы <filename>/proc/</filename> и <filename>/sys/</filename>

source: The <filename>/proc/</filename> and <filename>/sys/</filename> file trees are generated by “virtual” filesystems. This is a practical means of recovering information from the kernel (by listing virtual files) and communicating them to it (by writing to virtual files).
ru_ru: Структуры файлов в каталогах <filename>/proc/</filename> и <filename>/sys/</filename> генерируются “виртуальными” файловыми системами. Данные структуры являются практичным средством извлечения данных из ядра (путём чтения виртуальных файлов) и обмена данными с ядром (путём записи в виртуальные файлы).

source: <filename>/sys/</filename> in particular is designed to provide access to internal kernel objects, especially those representing the various devices in the system. The kernel can, thus, share various pieces of information: the status of each device (for example, if it is in energy saving mode), whether it is a removable device, etc. Note that <filename>/sys/</filename> has only existed since kernel version 2.6.
ru_ru: В частности, <filename>/sys/</filename> задумана для обеспечения доступа к внутренним объектам ядра, особенно к тем, что представляют различные устройства в системе. Ядро может предоставить разную информацию через эти объекты: статус каждого устройства (например, находится ли устройство в энергосберегающем режиме), является ли устройство извлекаемым и т. д. Стоит отметить, что <filename>/sys/</filename> появилась в ядре версии 2.6.

source: Surprisingly, the domain name is not managed in the same way, but comes from the complete name of the machine, acquired through name resolution. You can change it in the <filename>/etc/hosts</filename> file; simply write a complete name for the machine there at the beginning of the list of names associated with the address of the machine, as in the following example:
ru_ru: Интересно, что доменное имя назначается не таким же образом, а составляется из полного имени машины, полученного через систему доменных имен. Вы можете заменить его в файле <filename>/etc/hosts</filename>; просто запишите полное имя машины, связанное с её адресом, в начале списка имён как в нижеприведённом примере:

source: <primary>domain</primary><secondary>name</secondary>
ru_ru: <primary>доменное</primary><secondary>имя</secondary>

source: <primary>name</primary><secondary>domain</secondary>
ru_ru: <primary>имя</primary><secondary>доменное</secondary>

source: Name Resolution
ru_ru: Разрешение имён

source: <primary>resolution</primary><secondary>name</secondary>
ru_ru: <primary>разрешение</primary><secondary>имён</secondary>

source: <primary>name</primary><secondary>resolution</secondary>
ru_ru: <primary>имён</primary><secondary>разрешение</secondary>

source: The mechanism for name resolution in Linux is modular and can use various sources of information declared in the <filename>/etc/nsswitch.conf</filename> file. The entry that involves host name resolution is <literal>hosts</literal>. By default, it contains <literal>files dns</literal>, which means that the system consults the <filename>/etc/hosts</filename> file first, then DNS servers. NIS/NIS+ or LDAP servers are other possible sources.
ru_ru: Механизм разрешения имён в Linux является модульным и в нём используется несколько источников информации, определённых в файле <filename>/etc/nsswitch.conf</filename>. Запись, используемая для разрешения имени локальной машины, начинается с <literal>hosts</literal>. По умолчанию она содержит запись <literal>files dns</literal>, что означает, что система сначала сверяется с файлом <filename>/etc/hosts</filename>, а затем обращается к DNS серверу. Другими возможными источниками являются серверы NIS/NIS+ или LDAP.

source: <emphasis>NOTE</emphasis> NSS and DNS
ru_ru: <emphasis>ЗАМЕТКА</emphasis> NSS и DNS

source: Be aware that the commands specifically intended to query DNS (especially <command>host</command>) do not use the standard name resolution mechanism (NSS). As a consequence, they do not take into consideration <filename>/etc/nsswitch.conf</filename>, and thus, not <filename>/etc/hosts</filename> either.
ru_ru: Примите во внимание, что команды, предназначенные для формирования запросов к DNS (особенно <command>host</command>), не используют стандартный механизм разрешения имён (NSS). Как следствие, они не учитывают содержимое файлов <filename>/etc/nsswitch.conf</filename> и, соответственно, <filename>/etc/hosts</filename>.

source: Configuring DNS Servers
ru_ru: Настройка DNS серверов

source: <primary>Domain Name Service</primary>
ru_ru: <primary>Служба доменных имён</primary>

source: DNS (Domain Name Service) is a distributed and hierarchical service mapping names to IP addresses, and vice-versa. Specifically, it can turn a human-friendly name such as <literal>www.eyrolles.com</literal> into the actual IP address, <literal>213.244.11.247</literal>.
ru_ru: DNS (Служба доменных имён) - это иерархическая и распределёная служба отображения имён в IP адреса и наоборот. В частности, с её помощью можно превратить простое для человеческого восприятия имя, например <literal>www.eyrolles.com</literal>, в действительный IP адрес <literal>213.244.11.247</literal>.

source: To access DNS information, a DNS server must be available to relay requests. Falcot Corp has its own, but an individual user is more likely to use the DNS servers provided by their ISP.
ru_ru: Для доступа к информации DNS сервер должен быть настроен для ретрансляции запросов. В Falcot Corp используется собственный сервер, но частные пользователи скорее всего будут пользоваться DNS серверами, предоставляемыми поставщиками услуг.

source: The <filename>/etc/hosts</filename> file
ru_ru: Файл <filename>/etc/hosts</filename>

source: If there is no name server on the local network, it is still possible to establish a small table mapping IP addresses and machine hostnames in the <filename>/etc/hosts</filename> file, usually reserved for local network stations. The syntax of this file is very simple: each line indicates a specific IP address followed by the list of any associated names (the first being “completely qualified”, meaning it includes the domain name).
ru_ru: В случае, когда в локальной сети нет сервера имён, можно создать небольшую таблицу соответствия IP адресов и имён машин в файле <filename>/etc/hosts</filename>, который обычно зарезервирован для узлов локальной сети. Синтаксис этого файла очень прост: в каждой строке содержится IP адрес и список связанных с ним имён (первое из которых является “полным”, т. е. оно содержит в себе имя домена).

source: This file is available even during network outages or when DNS servers are unreachable, but will only really be useful when duplicated on all the machines on the network. The slightest alteration in correspondence will require the file to be updated everywhere. This is why <filename>/etc/hosts</filename> generally only contains the most important entries.
ru_ru: Этот файл доступен даже тогда, когда сеть отключена или когда DNS сервер недоступен, но он становится полезным только в том случае, когда его копия присутствует на всех машинах сети. Небольшое изменение файла приведёт к необходимости обновить его на всех узлах. Именно по этой причине <filename>/etc/hosts</filename> обычно содержит только самые необходимые записи.

source: This file will be sufficient for a small network not connected to the Internet, but with 5 machines or more, it is recommended to install a proper DNS server.
ru_ru: Данного файла вполне достаточно для небольшой локальной сети, не имеющей выхода в интернет, но при наличии 5 машин и боле рекомендуется установить DNS сервер.

source: <emphasis>TIP</emphasis> Bypassing DNS
ru_ru: <emphasis>СОВЕТ</emphasis> Обход DNS

source: Since applications check the <filename>/etc/hosts</filename> file before querying DNS, it is possible to include information in there that is different from what the DNS would return, and therefore to bypass normal DNS-based name resolution.
ru_ru: Поскольку приложения проверяют файл <filename>/etc/hosts</filename> до запроса к DNS, то в него можно включить записи, отличные от возвращаемых DNS сервером и таким образом обойти стандартную процедуру разрешения имён через DNS.

source: This allows, in the event of DNS changes not yet propagated, to test access to a website with the intended name even if this name is not properly mapped to the correct IP address yet.
ru_ru: В том случае, когда изменения в DNS ещё не успели распространиться, данный механизм позволяет протестировать доступ к сайту с целевым именем даже в том случае, когда это имя ещё не отображено на корректный IP адрес.

source: User and Group Databases
ru_ru: Базы данных пользователей и групп

source: <primary>user</primary><secondary>database</secondary>
ru_ru: <primary>пользователь</primary><secondary>база данных</secondary>

source: <primary>group</primary><secondary>database</secondary>
ru_ru: <primary>группа</primary><secondary>база данных</secondary>

source: <primary>database</primary><secondary>of users</secondary>
ru_ru: <primary>база данных</primary><secondary>пользователей</secondary>

source: <primary>database</primary><secondary>of groups</secondary>
ru_ru: <primary>база данных</primary><secondary>групп</secondary>

source: The list of users is usually stored in the <filename>/etc/passwd</filename> file, while the <filename>/etc/shadow</filename> file stores encrypted passwords. Both are text files, in a relatively simple format, which can be read and modified with a text editor. Each user is listed there on a line with several fields separated with a colon (“<literal>:</literal>”).
ru_ru: Список пользователей обычно хранится в файле <filename>/etc/passwd</filename>, в то время как зашифрованные пароли хранятся в файле <filename>/etc/shadow</filename>. Оба являются текстовыми файлами достаточно простого формата, которые можно редактировать обычным текстовым редактором. Запись для каждого пользователя занимает одну строку и содержит несколько полей, разделённых двоеточием (“<literal>:</literal>”).

source: <emphasis>NOTE</emphasis> Editing system files
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Редактирование системных файлов

source: The system files mentioned in this chapter are all plain text files, and can be edited with a text editor. Considering their importance to core system functionality, it is always a good idea to take extra precautions when editing system files. First, always make a copy or backup of a system file before opening or altering it. Second, on servers or machines where more than one person could potentially access the same file at the same time, take extra steps to guard against file corruption.
ru_ru: Все упоминаемые в этом разделе системные файлы являются простыми текстовыми файлами, их можно редактировать текстовым редактором. Принимая во внимание важность этих файлов для базовой системы, всегда стоит принимать дополнительные меры предосторожности перед их редактированием. Во-первых, всегда делайте резервную копию системного файла перед его открытием. Во-вторых, на серверах или на тех машинах, где несколько пользователей могут одновременно иметь доступ к одному и тому же файлу, примите дополнительные меры, предотвращающие его повреждение.
